MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
extern volatile SPI3IMSKHBITS SPI3IMSKHbits __attribute__((__sfr__));

#define SPI3URDTL SPI3URDTL
extern volatile uint16_t SPI3URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTLBITS {
  union {
    struct {
      uint16_t SPI3URDTL:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTLBITS;
extern volatile SPI3URDTLBITS SPI3URDTLbits __attribute__((__sfr__));

#define SPI3URDTH SPI3URDTH
extern volatile uint16_t SPI3URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3URDTHBITS {
  union {
    struct {
      uint16_t SPI3URDTH:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI3URDTHBITS;
extern volatile SPI3URDTHBITS SPI3URDTHbits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile uint16_t RPOR0 __attribute__((__sfr__));
typedef struct tagRPOR0BITS {
  uint16_t RP16R:7;
  uint16_t :1;
  uint16_t RP17R:7;
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t RPOR1 __attribute__((__sfr__));
typedef struct tagRPOR1BITS {
  uint16_t RP18R:7;
  uint16_t :1;
  uint16_t RP19R:7;
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t RPOR2 __attribute__((__sfr__));
typedef struct tagRPOR2BITS {
  uint16_t RP20R:7;
  uint16_t :1;
  uint16_t RP32R:7;
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
typedef struct tagRPOR3BITS {
  uint16_t RP33R:7;
  uint16_t :1;
  uint16_t RP34R:7;
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
typedef struct tagRPOR4BITS {
  uint16_t RP35R:7;
  uint16_t :1;
  uint16_t RP36R:7;
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
typedef struct tagRPOR5BITS {
  uint16_t RP37R:7;
  uint16_t :1;
  uint16_t RP38R:7;
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
typedef struct tagRPOR6BITS {
  uint16_t RP39R:7;
  uint16_t :1;
  uint16_t RP40R:7;
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
typedef struct tagRPOR7BITS {
  uint16_t RP41R:7;
  uint16_t :1;
  uint16_t RP43R:7;
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
typedef struct tagRPOR8BITS {
  uint16_t RP44R:7;
  uint16_t :1;
  uint16_t RP45R:7;
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
typedef struct tagRPOR9BITS {
  uint16_t RP46R:7;
  uint16_t :1;
  uint16_t RP47R:7;
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR16 RPOR16
extern volatile uint16_t RPOR16 __attribute__((__sfr__));
typedef struct tagRPOR16BITS {
  uint16_t RP61R:7;
  uint16_t :1;
  uint16_t RP62R:7;
} RPOR16BITS;
extern volatile RPOR16BITS RPOR16bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile uint16_t RPINR0 __attribute__((__sfr__));
typedef struct tagRPINR0BITS {
  uint16_t :8;
  uint16_t INT1R:8;
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile uint16_t RPINR1 __attribute__((__sfr__));
typedef struct tagRPINR1BITS {
  uint16_t INT2R:8;
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile uint16_t RPINR2 __attribute__((__sfr__));
typedef struct tagRPINR2BITS {
  uint16_t :8;
  uint16_t T1CKR:8;
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile uint16_t RPINR3 __attribute__((__sfr__));
typedef struct tagRPINR3BITS {
  uint16_t T2CKR:8;
  uint16_t T3CKR:8;
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR7 RPINR7
extern volatile uint16_t RPINR7 __attribute__((__sfr__));
typedef struct tagRPINR7BITS {
  uint16_t IC1R:8;
  uint16_t IC2R:8;
} RPINR7BITS;
extern volatile RPINR7BITS RPINR7bits __attribute__((__sfr__));

#define RPINR8 RPINR8
extern volatile uint16_t RPINR8 __attribute__((__sfr__));
typedef struct tagRPINR8BITS {
  uint16_t IC3R:8;
  uint16_t IC4R:8;
} RPINR8BITS;
extern volatile RPINR8BITS RPINR8bits __attribute__((__sfr__));

#define RPINR11 RPINR11
extern volatile uint16_t RPINR11 __attribute__((__sfr__));
typedef struct tagRPINR11BITS {
  uint16_t OCFAR:8;
} RPINR11BITS;
extern volatile RPINR11BITS RPINR11bits __attribute__((__sfr__));

#define RPINR12 RPINR12
extern volatile uint16_t RPINR12 __attribute__((__sfr__));
typedef struct tagRPINR12BITS {
  uint16_t FLT1R:8;
  uint16_t FLT2R:8;
} RPINR12BITS;
extern volatile RPINR12BITS RPINR12bits __attribute__((__sfr__));

#define RPINR13 RPINR13
extern volatile uint16_t RPINR13 __attribute__((__sfr__));
typedef struct tagRPINR13BITS {
  uint16_t FLT3R:8;
  uint16_t FLT4R:8;
} RPINR13BITS;
extern volatile RPINR13BITS RPINR13bits __attribute__((__sfr__));

#define RPINR18 RPINR18
extern volatile uint16_t RPINR18 __attribute__((__sfr__));
typedef struct tagRPINR18BITS {
  uint16_t U1RXR:8;
  uint16_t U1CTSR:8;
} RPINR18BITS;
extern volatile RPINR18BITS RPINR18bits __attribute__((__sfr__));

#define RPINR19 RPINR19
extern volatile uint16_t RPINR19 __attribute__((__sfr__));
typedef struct tagRPINR19BITS {
  uint16_t U2RXR:8;
  uint16_t U2CTSR:8;
} RPINR19BITS;
extern volatile RPINR19BITS RPINR19bits __attribute__((__sfr__));

#define RPINR20 RPINR20
extern volatile uint16_t RPINR20 __attribute__((__sfr__));
typedef struct tagRPINR20BITS {
  uint16_t SDI1R:8;
  uint16_t SCK1INR:8;
} RPINR20BITS;
extern volatile RPINR20BITS RPINR20bits __attribute__((__sfr__));

