MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

#define IPC17 IPC17
extern volatile uint16_t IPC17 __attribute__((__sfr__));
#define IPC18 IPC18
extern volatile uint16_t IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t PSESIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t PSESIP0:1;
      uint16_t PSESIP1:1;
      uint16_t PSESIP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

#define IPC22 IPC22
extern volatile uint16_t IPC22 __attribute__((__sfr__));
__extension__ typedef struct tagIPC22BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t SPI3TXIP:3;
      uint16_t :1;
      uint16_t SPI3RXIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t SPI3TXIP0:1;
      uint16_t SPI3TXIP1:1;
      uint16_t SPI3TXIP2:1;
      uint16_t :1;
      uint16_t SPI3RXIP0:1;
      uint16_t SPI3RXIP1:1;
      uint16_t SPI3RXIP2:1;
    };
  };
} IPC22BITS;
extern volatile IPC22BITS IPC22bits __attribute__((__sfr__));

#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t PWM1IP:3;
      uint16_t :1;
      uint16_t PWM2IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t PWM1IP0:1;
      uint16_t PWM1IP1:1;
      uint16_t PWM1IP2:1;
      uint16_t :1;
      uint16_t PWM2IP0:1;
      uint16_t PWM2IP1:1;
      uint16_t PWM2IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t PWM3IP:3;
      uint16_t :1;
      uint16_t PWM4IP:3;
      uint16_t :1;
      uint16_t PWM5IP:3;
      uint16_t :1;
      uint16_t PWM6IP:3;
    };
    struct {
      uint16_t PWM3IP0:1;
      uint16_t PWM3IP1:1;
      uint16_t PWM3IP2:1;
      uint16_t :1;
      uint16_t PWM4IP0:1;
      uint16_t PWM4IP1:1;
      uint16_t PWM4IP2:1;
      uint16_t :1;
      uint16_t PWM5IP0:1;
      uint16_t PWM5IP1:1;
      uint16_t PWM5IP2:1;
      uint16_t :1;
      uint16_t PWM6IP0:1;
      uint16_t PWM6IP1:1;
      uint16_t PWM6IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t PWM7IP:3;
      uint16_t :1;
      uint16_t PWM8IP:3;
      uint16_t :5;
      uint16_t AC2IP:3;
    };
    struct {
      uint16_t PWM7IP0:1;
      uint16_t PWM7IP1:1;
      uint16_t PWM7IP2:1;
      uint16_t :1;
      uint16_t PWM8IP0:1;
      uint16_t PWM8IP1:1;
      uint16_t PWM8IP2:1;
      uint16_t :5;
      uint16_t AC2IP0:1;
      uint16_t AC2IP1:1;
      uint16_t AC2IP2:1;
    };
    struct {
      uint16_t :12;
      uint16_t CMP2IP:3;
    };
    struct {
      uint16_t :12;
      uint16_t CMP2IP0:1;
      uint16_t CMP2IP1:1;
      uint16_t CMP2IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

#define IPC26 IPC26
extern volatile uint16_t IPC26 __attribute__((__sfr__));
__extension__ typedef struct tagIPC26BITS {
  union {
    struct {
      uint16_t AC3IP:3;
      uint16_t :1;
      uint16_t AC4IP:3;
    };
    struct {
      uint16_t AC3IP0:1;
      uint16_t AC3IP1:1;
      uint16_t AC3IP2:1;
      uint16_t :1;
      uint16_t AC4IP0:1;
      uint16_t AC4IP1:1;
      uint16_t AC4IP2:1;
    };
    struct {
      uint16_t CMP3IP:3;
      uint16_t :1;
      uint16_t CMP4IP:3;
    };
    struct {
      uint16_t CMP3IP0:1;
      uint16_t CMP3IP1:1;
      uint16_t CMP3IP2:1;
      uint16_t :1;
      uint16_t CMP4IP0:1;
      uint16_t CMP4IP1:1;
      uint16_t CMP4IP2:1;
    };
  };
} IPC26BITS;
extern volatile IPC26BITS IPC26bits __attribute__((__sfr__));

#define IPC27 IPC27
extern volatile uint16_t IPC27 __attribute__((__sfr__));
__extension__ typedef struct tagIPC27BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP:3;
      uint16_t :1;
      uint16_t ADCAN1IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t ADCAN0IP0:1;
      uint16_t ADCAN0IP1:1;
      uint16_t ADCAN0IP2:1;
      uint16_t :1;
      uint16_t ADCAN1IP0:1;
      uint16_t ADCAN1IP1:1;
      uint16_t ADCAN1IP2:1;
    };
  };
} IPC27BITS;
extern volatile IPC27BITS IPC27bits __attribute__((__sfr__));

#define IPC28 IPC28
extern volatile uint16_t IPC28 __attribute__((__sfr__));
__extension__ typedef struct tagIPC28BITS {
  union {
    struct {
      uint16_t ADCAN2IP:3;
      uint16_t :1;
      uint16_t ADCAN3IP:3;
      uint16_t :1;
      uint16_t ADCAN4IP:3;
    };
    struct {
      uint16_t ADCAN2IP0:1;
      uint16_t ADCAN2IP1:1;
      uint16_t ADCAN2IP2:1;
      uint16_t :1;
      uint16_t ADCAN3IP0:1;
      uint16_t ADCAN3IP1:1;
      uint16_t ADCAN3IP2:1;
      uint16_t :1;
      uint16_t ADCAN4IP0:1;
      uint16_t ADCAN4IP1:1;
      uint16_t ADCAN4IP2:1;
    };
  };
} IPC28BITS;
extern volatile IPC28BITS IPC28bits __attribute__((__sfr__));

#define IPC29 IPC29
extern volatile uint16_t IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      uint16_t ADCAN6IP:3;
      uint16_t :1;
      uint16_t ADCAN7IP:3;
    };
    struct {
      uint16_t ADCAN6IP0:1;
      uint16_t ADCAN6IP1:1;
      uint16_t ADCAN6IP2:1;
      uint16_t :1;
      uint16_t ADCAN7IP0:1;
      uint16_t ADCAN7IP1:1;
      uint16_t ADCAN7IP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define IPC31 IPC31
extern volatile uint16_t IPC31 __attribute__((__sfr__));
__extension__ typedef struct tagIPC31BITS {
  union {
    struct {
      uint16_t SPI1EIP:3;
      uint16_t :1;
      uint16_t SPI2EIP:3;
      uint16_t :1;
      uint16_t SPI3EIP:3;
    };
    struct {
      uint16_t SPI1EIP0:1;
      uint16_t SPI1EIP1:1;
      uint16_t SPI1EIP2:1;
      uint16_t :1;
      uint16_t SPI2EIP0:1;
      uint16_t SPI2EIP1:1;
      uint16_t SPI2EIP2:1;
      uint16_t :1;
      uint16_t SPI3EIP0:1;
      uint16_t SPI3EIP1:1;
      uint16_t SPI3EIP2:1;
    };
  };
} IPC31BITS;
extern volatile IPC31BITS IPC31bits __attribute__((__sfr__));

#define IPC34 IPC34
extern volatile uint16_t IPC34 __attribute__((__sfr__));
__extension__ typedef struct tagIPC34BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t CLC1IP:3;
      uint16_t :1;
      uint16_t CLC2IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t CLC1IP0:1;
      uint16_t CLC1IP1:1;
      uint16_t CLC1IP2:1;
      uint16_t :1;
      uint16_t CLC2IP0:1;
      uint16_t CLC2IP1:1;
      uint16_t CLC2IP2:1;
    };
  };
} IPC34BITS;
extern volatile IPC34BITS IPC34bits __attribute__((__sfr__));

