MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define IPC35 IPC35
extern volatile uint16_t IPC35 __attribute__((__sfr__));
__extension__ typedef struct tagIPC35BITS {
  union {
    struct {
      uint16_t CLC3IP:3;
      uint16_t :1;
      uint16_t CLC4IP:3;
      uint16_t :1;
      uint16_t ICDIP:3;
      uint16_t :1;
      uint16_t JTAGIP:3;
    };
    struct {
      uint16_t CLC3IP0:1;
      uint16_t CLC3IP1:1;
      uint16_t CLC3IP2:1;
      uint16_t :1;
      uint16_t CLC4IP0:1;
      uint16_t CLC4IP1:1;
      uint16_t CLC4IP2:1;
      uint16_t :1;
      uint16_t ICDIP0:1;
      uint16_t ICDIP1:1;
      uint16_t ICDIP2:1;
      uint16_t :1;
      uint16_t JTAGIP0:1;
      uint16_t JTAGIP1:1;
      uint16_t JTAGIP2:1;
    };
  };
} IPC35BITS;
extern volatile IPC35BITS IPC35bits __attribute__((__sfr__));

#define IPC36 IPC36
extern volatile uint16_t IPC36 __attribute__((__sfr__));
__extension__ typedef struct tagIPC36BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t PTGSTEPIP:3;
      uint16_t :1;
      uint16_t PTGWDTIP:3;
      uint16_t :1;
      uint16_t PTG0IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t PTGSTEP0:1;
      uint16_t PTGSTEP1:1;
      uint16_t PTGSTEP2:1;
      uint16_t :1;
      uint16_t PTGWDTP0:1;
      uint16_t PTGWDTP1:1;
      uint16_t PTGWDTP2:1;
      uint16_t :1;
      uint16_t PTGP0:1;
      uint16_t PTG0P1:1;
      uint16_t PTG0P2:1;
    };
  };
} IPC36BITS;
extern volatile IPC36BITS IPC36bits __attribute__((__sfr__));

#define IPC37 IPC37
extern volatile uint16_t IPC37 __attribute__((__sfr__));
__extension__ typedef struct tagIPC37BITS {
  union {
    struct {
      uint16_t PTG1IP:3;
      uint16_t :1;
      uint16_t PTG2IP:3;
      uint16_t :1;
      uint16_t PTG3IP:3;
    };
    struct {
      uint16_t PTG1P0:1;
      uint16_t PTG1P1:1;
      uint16_t PTG1P2:1;
      uint16_t :1;
      uint16_t PTG2P0:1;
      uint16_t PTG2P1:1;
      uint16_t PTG2P2:1;
      uint16_t :1;
      uint16_t PTG3P0:1;
      uint16_t PTG3P1:1;
      uint16_t PTG3P2:1;
    };
  };
} IPC37BITS;
extern volatile IPC37BITS IPC37bits __attribute__((__sfr__));

#define IPC40 IPC40
extern volatile uint16_t IPC40 __attribute__((__sfr__));
__extension__ typedef struct tagIPC40BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ADCAN18IP:3;
      uint16_t :1;
      uint16_t ADCAN19IP:3;
      uint16_t :1;
      uint16_t ADCAN20IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t ADCAN18IP0:1;
      uint16_t ADCAN18IP1:1;
      uint16_t ADCAN18IP2:1;
      uint16_t :1;
      uint16_t ADCAN19IP0:1;
      uint16_t ADCAN19IP1:1;
      uint16_t ADCAN19IP2:1;
      uint16_t :1;
      uint16_t ADCAN20IP0:1;
      uint16_t ADCAN20IP1:1;
      uint16_t ADCAN20IP2:1;
    };
  };
} IPC40BITS;
extern volatile IPC40BITS IPC40bits __attribute__((__sfr__));

#define IPC41 IPC41
extern volatile uint16_t IPC41 __attribute__((__sfr__));
__extension__ typedef struct tagIPC41BITS {
  union {
    struct {
      uint16_t ADCAN21IP:3;
    };
    struct {
      uint16_t ADCAN21IP0:1;
      uint16_t ADCAN21IP1:1;
      uint16_t ADCAN21IP2:1;
    };
  };
} IPC41BITS;
extern volatile IPC41BITS IPC41bits __attribute__((__sfr__));

#define IPC42 IPC42
extern volatile uint16_t IPC42 __attribute__((__sfr__));
#define IPC43 IPC43
extern volatile uint16_t IPC43 __attribute__((__sfr__));
__extension__ typedef struct tagIPC43BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t I2C1BCIP:3;
      uint16_t :1;
      uint16_t I2C2BCIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t I2C1BCIP0:1;
      uint16_t I2C1BCIP1:1;
      uint16_t I2C1BCIP2:1;
      uint16_t :1;
      uint16_t I2C2BCIP0:1;
      uint16_t I2C2BCIP1:1;
      uint16_t I2C2BCIP2:1;
    };
  };
} IPC43BITS;
extern volatile IPC43BITS IPC43bits __attribute__((__sfr__));

#define IPC44 IPC44
extern volatile uint16_t IPC44 __attribute__((__sfr__));
__extension__ typedef struct tagIPC44BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ADCMP0IP:3;
      uint16_t :1;
      uint16_t ADCMP1IP:3;
      uint16_t :1;
      uint16_t ADFLTR0IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t ADCMP0IP0:1;
      uint16_t ADCMP0IP1:1;
      uint16_t ADCMP0IP2:1;
      uint16_t :1;
      uint16_t ADCMP1IP0:1;
      uint16_t ADCMP1IP1:1;
      uint16_t ADCMP1IP2:1;
      uint16_t :1;
      uint16_t ADFLTR0IP0:1;
      uint16_t ADFLTR0IP1:1;
      uint16_t ADFLTR0IP2:1;
    };
  };
} IPC44BITS;
extern volatile IPC44BITS IPC44bits __attribute__((__sfr__));

#define IPC45 IPC45
extern volatile uint16_t IPC45 __attribute__((__sfr__));
__extension__ typedef struct tagIPC45BITS {
  union {
    struct {
      uint16_t ADFLTR1IP:3;
    };
    struct {
      uint16_t ADFLTR1IP0:1;
      uint16_t ADFLTR1IP1:1;
      uint16_t ADFLTR1IP2:1;
    };
  };
} IPC45BITS;
extern volatile IPC45BITS IPC45bits __attribute__((__sfr__));

#define IPC46 IPC46
extern volatile uint16_t IPC46 __attribute__((__sfr__));
__extension__ typedef struct tagIPC46BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t ADCC0EIP:3;
    };
    struct {
      uint16_t :12;
      uint16_t ADCC0EP0:1;
      uint16_t ADCC0EP1:1;
      uint16_t ADCC0EP2:1;
    };
  };
} IPC46BITS;
extern volatile IPC46BITS IPC46bits __attribute__((__sfr__));

#define IPC47 IPC47
extern volatile uint16_t IPC47 __attribute__((__sfr__));
__extension__ typedef struct tagIPC47BITS {
  union {
    struct {
      uint16_t ADCC1EIP:3;
      uint16_t :1;
      uint16_t ADCC2EIP:3;
      uint16_t :1;
      uint16_t ADCC3EIP:3;
    };
    struct {
      uint16_t ADCC1EP0:1;
      uint16_t ADCC1EP1:1;
      uint16_t ADCC1EP2:1;
      uint16_t :1;
      uint16_t ADCC2EP0:1;
      uint16_t ADCC2EP1:1;
      uint16_t ADCC2EP2:1;
      uint16_t :1;
      uint16_t ADCC3EP0:1;
      uint16_t ADCC3EP1:1;
      uint16_t ADCC3EP2:1;
    };
  };
} IPC47BITS;
extern volatile IPC47BITS IPC47bits __attribute__((__sfr__));

#define INTCON1 INTCON1
extern volatile uint16_t INTCON1 __attribute__((__sfr__));
typedef struct tagINTCON1BITS {
  uint16_t :1;
  uint16_t OSCFAIL:1;
  uint16_t STKERR:1;
  uint16_t ADDRERR:1;
  uint16_t MATHERR:1;
  uint16_t :1;
  uint16_t DIV0ERR:1;
  uint16_t SFTACERR:1;
  uint16_t COVTE:1;
  uint16_t OVBTE:1;
  uint16_t OVATE:1;
  uint16_t COVBERR:1;
  uint16_t COVAERR:1;
  uint16_t OVBERR:1;
  uint16_t OVAERR:1;
  uint16_t NSTDIS:1;
} INTCON1BITS;
