MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
/* PMD6 */
#define _SPI3MD PMD6bits.SPI3MD
#define _PWM1MD PMD6bits.PWM1MD
#define _PWM2MD PMD6bits.PWM2MD
#define _PWM3MD PMD6bits.PWM3MD
#define _PWM4MD PMD6bits.PWM4MD
#define _PWM5MD PMD6bits.PWM5MD
#define _PWM6MD PMD6bits.PWM6MD
#define _PWM7MD PMD6bits.PWM7MD
#define _PWM8MD PMD6bits.PWM8MD

/* PMD7 */
#define _PGA1MD PMD7bits.PGA1MD
#define _PTGMD PMD7bits.PTGMD
#define _CMP1MD PMD7bits.CMP1MD
#define _CMP2MD PMD7bits.CMP2MD
#define _CMP3MD PMD7bits.CMP3MD
#define _CMP4MD PMD7bits.CMP4MD

/* PMD8 */
#define _CCSMD PMD8bits.CCSMD
#define _CLC1MD PMD8bits.CLC1MD
#define _CLC2MD PMD8bits.CLC2MD
#define _CLC3MD PMD8bits.CLC3MD
#define _CLC4MD PMD8bits.CLC4MD
#define _ABGMD PMD8bits.ABGMD
#define _PGA2MD PMD8bits.PGA2MD

/* IFS0 */
#define _INT0IF IFS0bits.INT0IF
#define _IC1IF IFS0bits.IC1IF
#define _OC1IF IFS0bits.OC1IF
#define _T1IF IFS0bits.T1IF
#define _IC2IF IFS0bits.IC2IF
#define _OC2IF IFS0bits.OC2IF
#define _T2IF IFS0bits.T2IF
#define _T3IF IFS0bits.T3IF
#define _SPI1TXIF IFS0bits.SPI1TXIF
#define _SPI1RXIF IFS0bits.SPI1RXIF
#define _U1RXIF IFS0bits.U1RXIF
#define _U1TXIF IFS0bits.U1TXIF
#define _ADCIF IFS0bits.ADCIF
#define _NVMIF IFS0bits.NVMIF

/* IFS1 */
#define _SI2C1IF IFS1bits.SI2C1IF
#define _MI2C1IF IFS1bits.MI2C1IF
#define _AC1IF IFS1bits.AC1IF
#define _CNIF IFS1bits.CNIF
#define _INT1IF IFS1bits.INT1IF
#define _OC3IF IFS1bits.OC3IF
#define _OC4IF IFS1bits.OC4IF
#define _T4IF IFS1bits.T4IF
#define _T5IF IFS1bits.T5IF
#define _INT2IF IFS1bits.INT2IF
#define _U2RXIF IFS1bits.U2RXIF
#define _U2TXIF IFS1bits.U2TXIF

/* IFS2 */
#define _SPI2TXIF IFS2bits.SPI2TXIF
#define _SPI2RXIF IFS2bits.SPI2RXIF
#define _IC3IF IFS2bits.IC3IF
#define _IC4IF IFS2bits.IC4IF

/* IFS3 */
#define _SI2C2IF IFS3bits.SI2C2IF
#define _MI2C2IF IFS3bits.MI2C2IF
#define _INT4IF IFS3bits.INT4IF
#define _PSEMIF IFS3bits.PSEMIF

/* IFS4 */
#define _U1EIF IFS4bits.U1EIF
#define _U2EIF IFS4bits.U2EIF
#define _PSESIF IFS4bits.PSESIF

/* IFS5 */
#define _SPI3TXIF IFS5bits.SPI3TXIF
#define _SPI3RXIF IFS5bits.SPI3RXIF
#define _PWM1IF IFS5bits.PWM1IF
#define _PWM2IF IFS5bits.PWM2IF

/* IFS6 */
#define _PWM3IF IFS6bits.PWM3IF
#define _PWM4IF IFS6bits.PWM4IF
#define _PWM5IF IFS6bits.PWM5IF
#define _PWM6IF IFS6bits.PWM6IF
#define _PWM7IF IFS6bits.PWM7IF
#define _PWM8IF IFS6bits.PWM8IF
#define _AC2IF IFS6bits.AC2IF
#define _AC3IF IFS6bits.AC3IF
#define _AC4IF IFS6bits.AC4IF
#define _ADCAN0IF IFS6bits.ADCAN0IF
#define _ADCAN1IF IFS6bits.ADCAN1IF

/* IFS7 */
#define _ADCAN2IF IFS7bits.ADCAN2IF
#define _ADCAN3IF IFS7bits.ADCAN3IF
#define _ADCAN4IF IFS7bits.ADCAN4IF
#define _ADCAN6IF IFS7bits.ADCAN6IF
#define _ADCAN7IF IFS7bits.ADCAN7IF
#define _SPI1EIF IFS7bits.SPI1EIF
#define _SPI2EIF IFS7bits.SPI2EIF
#define _SPI3EIF IFS7bits.SPI3EIF

/* IFS8 */
#define _CLC1IF IFS8bits.CLC1IF
#define _CLC2IF IFS8bits.CLC2IF
#define _CLC3IF IFS8bits.CLC3IF
#define _CLC4IF IFS8bits.CLC4IF
/* Bitname _ICDIF cannot be defined because it is used by more than one SFR */
#define _JTAGIF IFS8bits.JTAGIF

/* IFS9 */
#define _PTGSTEPIF IFS9bits.PTGSTEPIF
#define _PTGWDTIF IFS9bits.PTGWDTIF
#define _PTG0IF IFS9bits.PTG0IF
#define _PTG1IF IFS9bits.PTG1IF
#define _PTG2IF IFS9bits.PTG2IF
#define _PTG3IF IFS9bits.PTG3IF

/* IFS10 */
#define _ADCAN18IF IFS10bits.ADCAN18IF
#define _ADCAN19IF IFS10bits.ADCAN19IF
#define _ADCAN20IF IFS10bits.ADCAN20IF
#define _ADCAN21IF IFS10bits.ADCAN21IF
#define _I2C1BCIF IFS10bits.I2C1BCIF
#define _I2C2BCIF IFS10bits.I2C2BCIF

/* IFS11 */
#define _ADCMP0IF IFS11bits.ADCMP0IF
#define _ADCMP1IF IFS11bits.ADCMP1IF
#define _ADFLTR0IF IFS11bits.ADFLTR0IF
#define _ADFLTR1IF IFS11bits.ADFLTR1IF
#define _ADCC0EIF IFS11bits.ADCC0EIF
#define _ADCC1EIF IFS11bits.ADCC1EIF
#define _ADCC2EIF IFS11bits.ADCC2EIF
#define _ADCC3EIF IFS11bits.ADCC3EIF

/* IEC0 */
#define _INT0IE IEC0bits.INT0IE
#define _IC1IE IEC0bits.IC1IE
#define _OC1IE IEC0bits.OC1IE
#define _T1IE IEC0bits.T1IE
#define _IC2IE IEC0bits.IC2IE
#define _OC2IE IEC0bits.OC2IE
#define _T2IE IEC0bits.T2IE
#define _T3IE IEC0bits.T3IE
#define _SPI1TXIE IEC0bits.SPI1TXIE
#define _SPI1RXIE IEC0bits.SPI1RXIE
#define _U1RXIE IEC0bits.U1RXIE
#define _U1TXIE IEC0bits.U1TXIE
#define _ADCIE IEC0bits.ADCIE
#define _NVMIE IEC0bits.NVMIE

/* IEC1 */
#define _SI2C1IE IEC1bits.SI2C1IE
#define _MI2C1IE IEC1bits.MI2C1IE
#define _AC1IE IEC1bits.AC1IE
#define _CNIE IEC1bits.CNIE
#define _INT1IE IEC1bits.INT1IE
#define _OC3IE IEC1bits.OC3IE
#define _OC4IE IEC1bits.OC4IE
#define _T4IE IEC1bits.T4IE
#define _T5IE IEC1bits.T5IE
#define _INT2IE IEC1bits.INT2IE
#define _U2RXIE IEC1bits.U2RXIE
#define _U2TXIE IEC1bits.U2TXIE

/* IEC2 */
#define _SPI2TXIE IEC2bits.SPI2TXIE
#define _SPI2RXIE IEC2bits.SPI2RXIE
#define _IC3IE IEC2bits.IC3IE
#define _IC4IE IEC2bits.IC4IE

/* IEC3 */
#define _SI2C2IE IEC3bits.SI2C2IE
#define _MI2C2IE IEC3bits.MI2C2IE
#define _INT4IE IEC3bits.INT4IE
#define _PSEMIE IEC3bits.PSEMIE

/* IEC4 */
#define _U1EIE IEC4bits.U1EIE
#define _U2EIE IEC4bits.U2EIE
#define _PSESIE IEC4bits.PSESIE

/* IEC5 */
#define _SPI3TXIE IEC5bits.SPI3TXIE
#define _SPI3RXIE IEC5bits.SPI3RXIE
#define _PWM1IE IEC5bits.PWM1IE
#define _PWM2IE IEC5bits.PWM2IE

/* IEC6 */
#define _PWM3IE IEC6bits.PWM3IE
#define _PWM4IE IEC6bits.PWM4IE
#define _PWM5IE IEC6bits.PWM5IE
#define _PWM6IE IEC6bits.PWM6IE
#define _PWM7IE IEC6bits.PWM7IE
#define _PWM8IE IEC6bits.PWM8IE
#define _AC2IE IEC6bits.AC2IE
#define _AC3IE IEC6bits.AC3IE
#define _AC4IE IEC6bits.AC4IE
#define _ADCAN0IE IEC6bits.ADCAN0IE
#define _ADCAN1IE IEC6bits.ADCAN1IE

/* IEC7 */
#define _ADCAN2IE IEC7bits.ADCAN2IE
#define _ADCAN3IE IEC7bits.ADCAN3IE
#define _ADCAN4IE IEC7bits.ADCAN4IE
#define _ADCAN6IE IEC7bits.ADCAN6IE
#define _ADCAN7IE IEC7bits.ADCAN7IE
#define _SPI1EIE IEC7bits.SPI1EIE
#define _SPI2EIE IEC7bits.SPI2EIE
#define _SPI3EIE IEC7bits.SPI3EIE

/* IEC8 */
#define _CLC1IE IEC8bits.CLC1IE
#define _CLC2IE IEC8bits.CLC2IE
#define _CLC3IE IEC8bits.CLC3IE
#define _CLC4IE IEC8bits.CLC4IE
/* Bitname _ICDIF cannot be defined because it is used by more than one SFR */
#define _JTAGIE IEC8bits.JTAGIE

/* IEC9 */
#define _PTGSTEPIE IEC9bits.PTGSTEPIE
#define _PTGWDTIE IEC9bits.PTGWDTIE
#define _PTG0IE IEC9bits.PTG0IE
#define _PTG1IE IEC9bits.PTG1IE
#define _PTG2IE IEC9bits.PTG2IE
#define _PTG3IE IEC9bits.PTG3IE

/* IEC10 */
#define _ADCAN18IE IEC10bits.ADCAN18IE
#define _ADCAN19IE IEC10bits.ADCAN19IE
#define _ADCAN20IE IEC10bits.ADCAN20IE
#define _ADCAN21IE IEC10bits.ADCAN21IE
#define _I2C1BCIE IEC10bits.I2C1BCIE
#define _I2C2BCIE IEC10bits.I2C2BCIE

/* IEC11 */
#define _ADCMP0IE IEC11bits.ADCMP0IE
#define _ADCMP1IE IEC11bits.ADCMP1IE
#define _ADFLTR0IE IEC11bits.ADFLTR0IE
#define _ADFLTR1IE IEC11bits.ADFLTR1IE
#define _ADCC0EIE IEC11bits.ADCC0EIE
#define _ADCC1EIE IEC11bits.ADCC1EIE
#define _ADCC2EIE IEC11bits.ADCC2EIE
#define _ADCC3EIE IEC11bits.ADCC3EIE

