MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
/* IPC25 */
#define _PWM7IP IPC25bits.PWM7IP
#define _PWM8IP IPC25bits.PWM8IP
#define _AC2IP IPC25bits.AC2IP
#define _PWM7IP0 IPC25bits.PWM7IP0
#define _PWM7IP1 IPC25bits.PWM7IP1
#define _PWM7IP2 IPC25bits.PWM7IP2
#define _PWM8IP0 IPC25bits.PWM8IP0
#define _PWM8IP1 IPC25bits.PWM8IP1
#define _PWM8IP2 IPC25bits.PWM8IP2
#define _AC2IP0 IPC25bits.AC2IP0
#define _AC2IP1 IPC25bits.AC2IP1
#define _AC2IP2 IPC25bits.AC2IP2
#define _CMP2IP IPC25bits.CMP2IP
#define _CMP2IP0 IPC25bits.CMP2IP0
#define _CMP2IP1 IPC25bits.CMP2IP1
#define _CMP2IP2 IPC25bits.CMP2IP2

/* IPC26 */
#define _AC3IP IPC26bits.AC3IP
#define _AC4IP IPC26bits.AC4IP
#define _AC3IP0 IPC26bits.AC3IP0
#define _AC3IP1 IPC26bits.AC3IP1
#define _AC3IP2 IPC26bits.AC3IP2
#define _AC4IP0 IPC26bits.AC4IP0
#define _AC4IP1 IPC26bits.AC4IP1
#define _AC4IP2 IPC26bits.AC4IP2
#define _CMP3IP IPC26bits.CMP3IP
#define _CMP4IP IPC26bits.CMP4IP
#define _CMP3IP0 IPC26bits.CMP3IP0
#define _CMP3IP1 IPC26bits.CMP3IP1
#define _CMP3IP2 IPC26bits.CMP3IP2
#define _CMP4IP0 IPC26bits.CMP4IP0
#define _CMP4IP1 IPC26bits.CMP4IP1
#define _CMP4IP2 IPC26bits.CMP4IP2

/* IPC27 */
#define _ADCAN0IP IPC27bits.ADCAN0IP
#define _ADCAN1IP IPC27bits.ADCAN1IP
#define _ADCAN0IP0 IPC27bits.ADCAN0IP0
#define _ADCAN0IP1 IPC27bits.ADCAN0IP1
#define _ADCAN0IP2 IPC27bits.ADCAN0IP2
#define _ADCAN1IP0 IPC27bits.ADCAN1IP0
#define _ADCAN1IP1 IPC27bits.ADCAN1IP1
#define _ADCAN1IP2 IPC27bits.ADCAN1IP2

/* IPC28 */
#define _ADCAN2IP IPC28bits.ADCAN2IP
#define _ADCAN3IP IPC28bits.ADCAN3IP
#define _ADCAN4IP IPC28bits.ADCAN4IP
#define _ADCAN2IP0 IPC28bits.ADCAN2IP0
#define _ADCAN2IP1 IPC28bits.ADCAN2IP1
#define _ADCAN2IP2 IPC28bits.ADCAN2IP2
#define _ADCAN3IP0 IPC28bits.ADCAN3IP0
#define _ADCAN3IP1 IPC28bits.ADCAN3IP1
#define _ADCAN3IP2 IPC28bits.ADCAN3IP2
#define _ADCAN4IP0 IPC28bits.ADCAN4IP0
#define _ADCAN4IP1 IPC28bits.ADCAN4IP1
#define _ADCAN4IP2 IPC28bits.ADCAN4IP2

/* IPC29 */
#define _ADCAN6IP IPC29bits.ADCAN6IP
#define _ADCAN7IP IPC29bits.ADCAN7IP
#define _ADCAN6IP0 IPC29bits.ADCAN6IP0
#define _ADCAN6IP1 IPC29bits.ADCAN6IP1
#define _ADCAN6IP2 IPC29bits.ADCAN6IP2
#define _ADCAN7IP0 IPC29bits.ADCAN7IP0
#define _ADCAN7IP1 IPC29bits.ADCAN7IP1
#define _ADCAN7IP2 IPC29bits.ADCAN7IP2

/* IPC31 */
#define _SPI1EIP IPC31bits.SPI1EIP
#define _SPI2EIP IPC31bits.SPI2EIP
#define _SPI3EIP IPC31bits.SPI3EIP
#define _SPI1EIP0 IPC31bits.SPI1EIP0
#define _SPI1EIP1 IPC31bits.SPI1EIP1
#define _SPI1EIP2 IPC31bits.SPI1EIP2
#define _SPI2EIP0 IPC31bits.SPI2EIP0
#define _SPI2EIP1 IPC31bits.SPI2EIP1
#define _SPI2EIP2 IPC31bits.SPI2EIP2
#define _SPI3EIP0 IPC31bits.SPI3EIP0
#define _SPI3EIP1 IPC31bits.SPI3EIP1
#define _SPI3EIP2 IPC31bits.SPI3EIP2

/* IPC34 */
#define _CLC1IP IPC34bits.CLC1IP
#define _CLC2IP IPC34bits.CLC2IP
#define _CLC1IP0 IPC34bits.CLC1IP0
#define _CLC1IP1 IPC34bits.CLC1IP1
#define _CLC1IP2 IPC34bits.CLC1IP2
#define _CLC2IP0 IPC34bits.CLC2IP0
#define _CLC2IP1 IPC34bits.CLC2IP1
#define _CLC2IP2 IPC34bits.CLC2IP2

/* IPC35 */
#define _CLC3IP IPC35bits.CLC3IP
#define _CLC4IP IPC35bits.CLC4IP
#define _ICDIP IPC35bits.ICDIP
#define _JTAGIP IPC35bits.JTAGIP
#define _CLC3IP0 IPC35bits.CLC3IP0
#define _CLC3IP1 IPC35bits.CLC3IP1
#define _CLC3IP2 IPC35bits.CLC3IP2
#define _CLC4IP0 IPC35bits.CLC4IP0
#define _CLC4IP1 IPC35bits.CLC4IP1
#define _CLC4IP2 IPC35bits.CLC4IP2
#define _ICDIP0 IPC35bits.ICDIP0
#define _ICDIP1 IPC35bits.ICDIP1
#define _ICDIP2 IPC35bits.ICDIP2
#define _JTAGIP0 IPC35bits.JTAGIP0
#define _JTAGIP1 IPC35bits.JTAGIP1
#define _JTAGIP2 IPC35bits.JTAGIP2

/* IPC36 */
#define _PTGSTEPIP IPC36bits.PTGSTEPIP
#define _PTGWDTIP IPC36bits.PTGWDTIP
#define _PTG0IP IPC36bits.PTG0IP
#define _PTGSTEP0 IPC36bits.PTGSTEP0
#define _PTGSTEP1 IPC36bits.PTGSTEP1
#define _PTGSTEP2 IPC36bits.PTGSTEP2
#define _PTGWDTP0 IPC36bits.PTGWDTP0
#define _PTGWDTP1 IPC36bits.PTGWDTP1
#define _PTGWDTP2 IPC36bits.PTGWDTP2
#define _PTGP0 IPC36bits.PTGP0
#define _PTG0P1 IPC36bits.PTG0P1
#define _PTG0P2 IPC36bits.PTG0P2

/* IPC37 */
#define _PTG1IP IPC37bits.PTG1IP
#define _PTG2IP IPC37bits.PTG2IP
#define _PTG3IP IPC37bits.PTG3IP
#define _PTG1P0 IPC37bits.PTG1P0
#define _PTG1P1 IPC37bits.PTG1P1
#define _PTG1P2 IPC37bits.PTG1P2
#define _PTG2P0 IPC37bits.PTG2P0
#define _PTG2P1 IPC37bits.PTG2P1
#define _PTG2P2 IPC37bits.PTG2P2
#define _PTG3P0 IPC37bits.PTG3P0
#define _PTG3P1 IPC37bits.PTG3P1
#define _PTG3P2 IPC37bits.PTG3P2

/* IPC40 */
#define _ADCAN18IP IPC40bits.ADCAN18IP
#define _ADCAN19IP IPC40bits.ADCAN19IP
#define _ADCAN20IP IPC40bits.ADCAN20IP
#define _ADCAN18IP0 IPC40bits.ADCAN18IP0
#define _ADCAN18IP1 IPC40bits.ADCAN18IP1
#define _ADCAN18IP2 IPC40bits.ADCAN18IP2
#define _ADCAN19IP0 IPC40bits.ADCAN19IP0
#define _ADCAN19IP1 IPC40bits.ADCAN19IP1
#define _ADCAN19IP2 IPC40bits.ADCAN19IP2
#define _ADCAN20IP0 IPC40bits.ADCAN20IP0
#define _ADCAN20IP1 IPC40bits.ADCAN20IP1
#define _ADCAN20IP2 IPC40bits.ADCAN20IP2

/* IPC41 */
#define _ADCAN21IP IPC41bits.ADCAN21IP
#define _ADCAN21IP0 IPC41bits.ADCAN21IP0
#define _ADCAN21IP1 IPC41bits.ADCAN21IP1
#define _ADCAN21IP2 IPC41bits.ADCAN21IP2

/* IPC43 */
#define _I2C1BCIP IPC43bits.I2C1BCIP
#define _I2C2BCIP IPC43bits.I2C2BCIP
#define _I2C1BCIP0 IPC43bits.I2C1BCIP0
#define _I2C1BCIP1 IPC43bits.I2C1BCIP1
#define _I2C1BCIP2 IPC43bits.I2C1BCIP2
#define _I2C2BCIP0 IPC43bits.I2C2BCIP0
#define _I2C2BCIP1 IPC43bits.I2C2BCIP1
#define _I2C2BCIP2 IPC43bits.I2C2BCIP2

/* IPC44 */
#define _ADCMP0IP IPC44bits.ADCMP0IP
#define _ADCMP1IP IPC44bits.ADCMP1IP
#define _ADFLTR0IP IPC44bits.ADFLTR0IP
#define _ADCMP0IP0 IPC44bits.ADCMP0IP0
#define _ADCMP0IP1 IPC44bits.ADCMP0IP1
#define _ADCMP0IP2 IPC44bits.ADCMP0IP2
#define _ADCMP1IP0 IPC44bits.ADCMP1IP0
#define _ADCMP1IP1 IPC44bits.ADCMP1IP1
#define _ADCMP1IP2 IPC44bits.ADCMP1IP2
#define _ADFLTR0IP0 IPC44bits.ADFLTR0IP0
#define _ADFLTR0IP1 IPC44bits.ADFLTR0IP1
#define _ADFLTR0IP2 IPC44bits.ADFLTR0IP2

/* IPC45 */
#define _ADFLTR1IP IPC45bits.ADFLTR1IP
#define _ADFLTR1IP0 IPC45bits.ADFLTR1IP0
#define _ADFLTR1IP1 IPC45bits.ADFLTR1IP1
#define _ADFLTR1IP2 IPC45bits.ADFLTR1IP2

/* IPC46 */
#define _ADCC0EIP IPC46bits.ADCC0EIP
#define _ADCC0EP0 IPC46bits.ADCC0EP0
#define _ADCC0EP1 IPC46bits.ADCC0EP1
#define _ADCC0EP2 IPC46bits.ADCC0EP2

/* IPC47 */
#define _ADCC1EIP IPC47bits.ADCC1EIP
#define _ADCC2EIP IPC47bits.ADCC2EIP
#define _ADCC3EIP IPC47bits.ADCC3EIP
#define _ADCC1EP0 IPC47bits.ADCC1EP0
#define _ADCC1EP1 IPC47bits.ADCC1EP1
#define _ADCC1EP2 IPC47bits.ADCC1EP2
#define _ADCC2EP0 IPC47bits.ADCC2EP0
#define _ADCC2EP1 IPC47bits.ADCC2EP1
#define _ADCC2EP2 IPC47bits.ADCC2EP2
#define _ADCC3EP0 IPC47bits.ADCC3EP0
#define _ADCC3EP1 IPC47bits.ADCC3EP1
#define _ADCC3EP2 IPC47bits.ADCC3EP2

/* INTCON1 */
#define _OSCFAIL INTCON1bits.OSCFAIL
#define _STKERR INTCON1bits.STKERR
#define _ADDRERR INTCON1bits.ADDRERR
#define _MATHERR INTCON1bits.MATHERR
#define _DIV0ERR INTCON1bits.DIV0ERR
#define _SFTACERR INTCON1bits.SFTACERR
#define _COVTE INTCON1bits.COVTE
#define _OVBTE INTCON1bits.OVBTE
#define _OVATE INTCON1bits.OVATE
#define _COVBERR INTCON1bits.COVBERR
#define _COVAERR INTCON1bits.COVAERR
#define _OVBERR INTCON1bits.OVBERR
#define _OVAERR INTCON1bits.OVAERR
#define _NSTDIS INTCON1bits.NSTDIS

/* INTCON2 */
#define _INT0EP INTCON2bits.INT0EP
#define _INT1EP INTCON2bits.INT1EP
#define _INT2EP INTCON2bits.INT2EP
#define _INT4EP INTCON2bits.INT4EP
#define _AIVTEN INTCON2bits.AIVTEN
#define _SWTRAP INTCON2bits.SWTRAP
#define _DISI INTCON2bits.DISI
#define _GIE INTCON2bits.GIE

