MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _ADSTATH_AN19RDY_POSITION                0x00000003
#define _ADSTATH_AN19RDY_MASK                    0x00000008
#define _ADSTATH_AN19RDY_LENGTH                  0x00000001

#define _ADSTATH_AN20RDY_POSITION                0x00000004
#define _ADSTATH_AN20RDY_MASK                    0x00000010
#define _ADSTATH_AN20RDY_LENGTH                  0x00000001

#define _ADSTATH_AN21RDY_POSITION                0x00000005
#define _ADSTATH_AN21RDY_MASK                    0x00000020
#define _ADSTATH_AN21RDY_LENGTH                  0x00000001

#define _ADCMP0ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP0ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP0ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP0ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP0ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP0ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP0ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP0ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP0ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP0ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP0ENL_CMPEN4_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN6_POSITION               0x00000006
#define _ADCMP0ENL_CMPEN6_MASK                   0x00000040
#define _ADCMP0ENL_CMPEN6_LENGTH                 0x00000001

#define _ADCMP0ENL_CMPEN7_POSITION               0x00000007
#define _ADCMP0ENL_CMPEN7_MASK                   0x00000080
#define _ADCMP0ENL_CMPEN7_LENGTH                 0x00000001

#define _ADCMP0ENH_CMPEN18_POSITION              0x00000002
#define _ADCMP0ENH_CMPEN18_MASK                  0x00000004
#define _ADCMP0ENH_CMPEN18_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN19_POSITION              0x00000003
#define _ADCMP0ENH_CMPEN19_MASK                  0x00000008
#define _ADCMP0ENH_CMPEN19_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN20_POSITION              0x00000004
#define _ADCMP0ENH_CMPEN20_MASK                  0x00000010
#define _ADCMP0ENH_CMPEN20_LENGTH                0x00000001

#define _ADCMP0ENH_CMPEN21_POSITION              0x00000005
#define _ADCMP0ENH_CMPEN21_MASK                  0x00000020
#define _ADCMP0ENH_CMPEN21_LENGTH                0x00000001

#define _ADCMP1ENL_CMPEN0_POSITION               0x00000000
#define _ADCMP1ENL_CMPEN0_MASK                   0x00000001
#define _ADCMP1ENL_CMPEN0_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN1_POSITION               0x00000001
#define _ADCMP1ENL_CMPEN1_MASK                   0x00000002
#define _ADCMP1ENL_CMPEN1_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN2_POSITION               0x00000002
#define _ADCMP1ENL_CMPEN2_MASK                   0x00000004
#define _ADCMP1ENL_CMPEN2_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN3_POSITION               0x00000003
#define _ADCMP1ENL_CMPEN3_MASK                   0x00000008
#define _ADCMP1ENL_CMPEN3_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN4_POSITION               0x00000004
#define _ADCMP1ENL_CMPEN4_MASK                   0x00000010
#define _ADCMP1ENL_CMPEN4_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN6_POSITION               0x00000006
#define _ADCMP1ENL_CMPEN6_MASK                   0x00000040
#define _ADCMP1ENL_CMPEN6_LENGTH                 0x00000001

#define _ADCMP1ENL_CMPEN7_POSITION               0x00000007
#define _ADCMP1ENL_CMPEN7_MASK                   0x00000080
#define _ADCMP1ENL_CMPEN7_LENGTH                 0x00000001

#define _ADCMP1ENH_CMPEN18_POSITION              0x00000002
#define _ADCMP1ENH_CMPEN18_MASK                  0x00000004
#define _ADCMP1ENH_CMPEN18_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN19_POSITION              0x00000003
#define _ADCMP1ENH_CMPEN19_MASK                  0x00000008
#define _ADCMP1ENH_CMPEN19_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN20_POSITION              0x00000004
#define _ADCMP1ENH_CMPEN20_MASK                  0x00000010
#define _ADCMP1ENH_CMPEN20_LENGTH                0x00000001

#define _ADCMP1ENH_CMPEN21_POSITION              0x00000005
#define _ADCMP1ENH_CMPEN21_MASK                  0x00000020
#define _ADCMP1ENH_CMPEN21_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL_POSITION               0x00000000
#define _ADFL0CON_FLCHSEL_MASK                   0x0000001F
#define _ADFL0CON_FLCHSEL_LENGTH                 0x00000005

#define _ADFL0CON_RDY_POSITION                   0x00000008
#define _ADFL0CON_RDY_MASK                       0x00000100
#define _ADFL0CON_RDY_LENGTH                     0x00000001

#define _ADFL0CON_IE_POSITION                    0x00000009
#define _ADFL0CON_IE_MASK                        0x00000200
#define _ADFL0CON_IE_LENGTH                      0x00000001

#define _ADFL0CON_OVRSAM_POSITION                0x0000000A
#define _ADFL0CON_OVRSAM_MASK                    0x00001C00
#define _ADFL0CON_OVRSAM_LENGTH                  0x00000003

#define _ADFL0CON_MODE_POSITION                  0x0000000D
#define _ADFL0CON_MODE_MASK                      0x00006000
#define _ADFL0CON_MODE_LENGTH                    0x00000002

#define _ADFL0CON_FLEN_POSITION                  0x0000000F
#define _ADFL0CON_FLEN_MASK                      0x00008000
#define _ADFL0CON_FLEN_LENGTH                    0x00000001

#define _ADFL0CON_FLCHSEL0_POSITION              0x00000000
#define _ADFL0CON_FLCHSEL0_MASK                  0x00000001
#define _ADFL0CON_FLCHSEL0_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL1_POSITION              0x00000001
#define _ADFL0CON_FLCHSEL1_MASK                  0x00000002
#define _ADFL0CON_FLCHSEL1_LENGTH                0x00000001

#define _ADFL0CON_FLCHSEL2_POSITION              0x00000002
#define _ADFL0CON_FLCHSEL2_MASK                  0x00000004
#define _ADFL0CON_FLCHSEL2_LENGTH                0x00000001

