MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _ADTRIG0H_TRIGSRC23_POSITION             0x00000003
#define _ADTRIG0H_TRIGSRC23_MASK                 0x00000008
#define _ADTRIG0H_TRIGSRC23_LENGTH               0x00000001

#define _ADTRIG0H_TRIGSRC24_POSITION             0x00000004
#define _ADTRIG0H_TRIGSRC24_MASK                 0x00000010
#define _ADTRIG0H_TRIGSRC24_LENGTH               0x00000001

#define _ADTRIG0H_TRGSRC30_POSITION              0x00000008
#define _ADTRIG0H_TRGSRC30_MASK                  0x00000100
#define _ADTRIG0H_TRGSRC30_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC31_POSITION              0x00000009
#define _ADTRIG0H_TRGSRC31_MASK                  0x00000200
#define _ADTRIG0H_TRGSRC31_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC32_POSITION              0x0000000A
#define _ADTRIG0H_TRGSRC32_MASK                  0x00000400
#define _ADTRIG0H_TRGSRC32_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC33_POSITION              0x0000000B
#define _ADTRIG0H_TRGSRC33_MASK                  0x00000800
#define _ADTRIG0H_TRGSRC33_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC34_POSITION              0x0000000C
#define _ADTRIG0H_TRGSRC34_MASK                  0x00001000
#define _ADTRIG0H_TRGSRC34_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC20_POSITION              0x00000000
#define _ADTRIG0H_TRGSRC20_MASK                  0x00000001
#define _ADTRIG0H_TRGSRC20_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC21_POSITION              0x00000001
#define _ADTRIG0H_TRGSRC21_MASK                  0x00000002
#define _ADTRIG0H_TRGSRC21_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC22_POSITION              0x00000002
#define _ADTRIG0H_TRGSRC22_MASK                  0x00000004
#define _ADTRIG0H_TRGSRC22_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC23_POSITION              0x00000003
#define _ADTRIG0H_TRGSRC23_MASK                  0x00000008
#define _ADTRIG0H_TRGSRC23_LENGTH                0x00000001

#define _ADTRIG0H_TRGSRC24_POSITION              0x00000004
#define _ADTRIG0H_TRGSRC24_MASK                  0x00000010
#define _ADTRIG0H_TRGSRC24_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC4_POSITION               0x00000000
#define _ADTRIG1L_TRGSRC4_MASK                   0x0000001F
#define _ADTRIG1L_TRGSRC4_LENGTH                 0x00000005

#define _ADTRIG1L_TRIGSRC40_POSITION             0x00000000
#define _ADTRIG1L_TRIGSRC40_MASK                 0x00000001
#define _ADTRIG1L_TRIGSRC40_LENGTH               0x00000001

#define _ADTRIG1L_TRIGSRC41_POSITION             0x00000001
#define _ADTRIG1L_TRIGSRC41_MASK                 0x00000002
#define _ADTRIG1L_TRIGSRC41_LENGTH               0x00000001

#define _ADTRIG1L_TRIGSRC42_POSITION             0x00000002
#define _ADTRIG1L_TRIGSRC42_MASK                 0x00000004
#define _ADTRIG1L_TRIGSRC42_LENGTH               0x00000001

#define _ADTRIG1L_TRIGSRC43_POSITION             0x00000003
#define _ADTRIG1L_TRIGSRC43_MASK                 0x00000008
#define _ADTRIG1L_TRIGSRC43_LENGTH               0x00000001

#define _ADTRIG1L_TRIGSRC44_POSITION             0x00000004
#define _ADTRIG1L_TRIGSRC44_MASK                 0x00000010
#define _ADTRIG1L_TRIGSRC44_LENGTH               0x00000001

#define _ADTRIG1L_TRGSRC40_POSITION              0x00000000
#define _ADTRIG1L_TRGSRC40_MASK                  0x00000001
#define _ADTRIG1L_TRGSRC40_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC41_POSITION              0x00000001
#define _ADTRIG1L_TRGSRC41_MASK                  0x00000002
#define _ADTRIG1L_TRGSRC41_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC42_POSITION              0x00000002
#define _ADTRIG1L_TRGSRC42_MASK                  0x00000004
#define _ADTRIG1L_TRGSRC42_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC43_POSITION              0x00000003
#define _ADTRIG1L_TRGSRC43_MASK                  0x00000008
#define _ADTRIG1L_TRGSRC43_LENGTH                0x00000001

#define _ADTRIG1L_TRGSRC44_POSITION              0x00000004
#define _ADTRIG1L_TRGSRC44_MASK                  0x00000010
#define _ADTRIG1L_TRGSRC44_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC6_POSITION               0x00000000
#define _ADTRIG1H_TRGSRC6_MASK                   0x0000001F
#define _ADTRIG1H_TRGSRC6_LENGTH                 0x00000005

#define _ADTRIG1H_TRGSRC7_POSITION               0x00000008
#define _ADTRIG1H_TRGSRC7_MASK                   0x00001F00
#define _ADTRIG1H_TRGSRC7_LENGTH                 0x00000005

#define _ADTRIG1H_TRIGSRC60_POSITION             0x00000000
#define _ADTRIG1H_TRIGSRC60_MASK                 0x00000001
#define _ADTRIG1H_TRIGSRC60_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC61_POSITION             0x00000001
#define _ADTRIG1H_TRIGSRC61_MASK                 0x00000002
#define _ADTRIG1H_TRIGSRC61_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC62_POSITION             0x00000002
#define _ADTRIG1H_TRIGSRC62_MASK                 0x00000004
#define _ADTRIG1H_TRIGSRC62_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC63_POSITION             0x00000003
#define _ADTRIG1H_TRIGSRC63_MASK                 0x00000008
#define _ADTRIG1H_TRIGSRC63_LENGTH               0x00000001

#define _ADTRIG1H_TRIGSRC64_POSITION             0x00000004
#define _ADTRIG1H_TRIGSRC64_MASK                 0x00000010
#define _ADTRIG1H_TRIGSRC64_LENGTH               0x00000001

#define _ADTRIG1H_TRGSRC70_POSITION              0x00000008
#define _ADTRIG1H_TRGSRC70_MASK                  0x00000100
#define _ADTRIG1H_TRGSRC70_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC71_POSITION              0x00000009
#define _ADTRIG1H_TRGSRC71_MASK                  0x00000200
#define _ADTRIG1H_TRGSRC71_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC72_POSITION              0x0000000A
#define _ADTRIG1H_TRGSRC72_MASK                  0x00000400
#define _ADTRIG1H_TRGSRC72_LENGTH                0x00000001

#define _ADTRIG1H_TRGSRC73_POSITION              0x0000000B
#define _ADTRIG1H_TRGSRC73_MASK                  0x00000800
#define _ADTRIG1H_TRGSRC73_LENGTH                0x00000001

