MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _ADBASE_CHOFFSET_POSITION                0x00000000
#define _ADBASE_CHOFFSET_MASK                    0x0000FFFF
#define _ADBASE_CHOFFSET_LENGTH                  0x00000010

#define _ADBASE_CHOFFSET0_POSITION               0x00000000
#define _ADBASE_CHOFFSET0_MASK                   0x00000001
#define _ADBASE_CHOFFSET0_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET1_POSITION               0x00000001
#define _ADBASE_CHOFFSET1_MASK                   0x00000002
#define _ADBASE_CHOFFSET1_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET2_POSITION               0x00000002
#define _ADBASE_CHOFFSET2_MASK                   0x00000004
#define _ADBASE_CHOFFSET2_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET3_POSITION               0x00000003
#define _ADBASE_CHOFFSET3_MASK                   0x00000008
#define _ADBASE_CHOFFSET3_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET4_POSITION               0x00000004
#define _ADBASE_CHOFFSET4_MASK                   0x00000010
#define _ADBASE_CHOFFSET4_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET5_POSITION               0x00000005
#define _ADBASE_CHOFFSET5_MASK                   0x00000020
#define _ADBASE_CHOFFSET5_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET6_POSITION               0x00000006
#define _ADBASE_CHOFFSET6_MASK                   0x00000040
#define _ADBASE_CHOFFSET6_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET7_POSITION               0x00000007
#define _ADBASE_CHOFFSET7_MASK                   0x00000080
#define _ADBASE_CHOFFSET7_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET8_POSITION               0x00000008
#define _ADBASE_CHOFFSET8_MASK                   0x00000100
#define _ADBASE_CHOFFSET8_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET9_POSITION               0x00000009
#define _ADBASE_CHOFFSET9_MASK                   0x00000200
#define _ADBASE_CHOFFSET9_LENGTH                 0x00000001

#define _ADBASE_CHOFFSET10_POSITION              0x0000000A
#define _ADBASE_CHOFFSET10_MASK                  0x00000400
#define _ADBASE_CHOFFSET10_LENGTH                0x00000001

#define _ADBASE_CHOFFSET11_POSITION              0x0000000B
#define _ADBASE_CHOFFSET11_MASK                  0x00000800
#define _ADBASE_CHOFFSET11_LENGTH                0x00000001

#define _ADBASE_CHOFFSET12_POSITION              0x0000000C
#define _ADBASE_CHOFFSET12_MASK                  0x00001000
#define _ADBASE_CHOFFSET12_LENGTH                0x00000001

#define _ADBASE_CHOFFSET13_POSITION              0x0000000D
#define _ADBASE_CHOFFSET13_MASK                  0x00002000
#define _ADBASE_CHOFFSET13_LENGTH                0x00000001

#define _ADBASE_CHOFFSET14_POSITION              0x0000000E
#define _ADBASE_CHOFFSET14_MASK                  0x00004000
#define _ADBASE_CHOFFSET14_LENGTH                0x00000001

#define _ADBASE_CHOFFSET15_POSITION              0x0000000F
#define _ADBASE_CHOFFSET15_MASK                  0x00008000
#define _ADBASE_CHOFFSET15_LENGTH                0x00000001

#define _ADLVLTRGL_LVLEN0_POSITION               0x00000000
#define _ADLVLTRGL_LVLEN0_MASK                   0x00000001
#define _ADLVLTRGL_LVLEN0_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN1_POSITION               0x00000001
#define _ADLVLTRGL_LVLEN1_MASK                   0x00000002
#define _ADLVLTRGL_LVLEN1_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN2_POSITION               0x00000002
#define _ADLVLTRGL_LVLEN2_MASK                   0x00000004
#define _ADLVLTRGL_LVLEN2_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN3_POSITION               0x00000003
#define _ADLVLTRGL_LVLEN3_MASK                   0x00000008
#define _ADLVLTRGL_LVLEN3_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN4_POSITION               0x00000004
#define _ADLVLTRGL_LVLEN4_MASK                   0x00000010
#define _ADLVLTRGL_LVLEN4_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN6_POSITION               0x00000006
#define _ADLVLTRGL_LVLEN6_MASK                   0x00000040
#define _ADLVLTRGL_LVLEN6_LENGTH                 0x00000001

#define _ADLVLTRGL_LVLEN7_POSITION               0x00000007
#define _ADLVLTRGL_LVLEN7_MASK                   0x00000080
#define _ADLVLTRGL_LVLEN7_LENGTH                 0x00000001

#define _ADLVLTRGH_LVLEN18_POSITION              0x00000002
#define _ADLVLTRGH_LVLEN18_MASK                  0x00000004
#define _ADLVLTRGH_LVLEN18_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN19_POSITION              0x00000003
#define _ADLVLTRGH_LVLEN19_MASK                  0x00000008
#define _ADLVLTRGH_LVLEN19_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN20_POSITION              0x00000004
#define _ADLVLTRGH_LVLEN20_MASK                  0x00000010
#define _ADLVLTRGH_LVLEN20_LENGTH                0x00000001

#define _ADLVLTRGH_LVLEN21_POSITION              0x00000005
#define _ADLVLTRGH_LVLEN21_MASK                  0x00000020
#define _ADLVLTRGH_LVLEN21_LENGTH                0x00000001

#define _ADCORE0L_SAMC_POSITION                  0x00000000
#define _ADCORE0L_SAMC_MASK                      0x000003FF
#define _ADCORE0L_SAMC_LENGTH                    0x0000000A

#define _ADCORE0L_SAMC0_POSITION                 0x00000000
#define _ADCORE0L_SAMC0_MASK                     0x00000001
#define _ADCORE0L_SAMC0_LENGTH                   0x00000001

#define _ADCORE0L_SAMC1_POSITION                 0x00000001
#define _ADCORE0L_SAMC1_MASK                     0x00000002
#define _ADCORE0L_SAMC1_LENGTH                   0x00000001

#define _ADCORE0L_SAMC2_POSITION                 0x00000002
#define _ADCORE0L_SAMC2_MASK                     0x00000004
#define _ADCORE0L_SAMC2_LENGTH                   0x00000001

#define _ADCORE0L_SAMC3_POSITION                 0x00000003
#define _ADCORE0L_SAMC3_MASK                     0x00000008
#define _ADCORE0L_SAMC3_LENGTH                   0x00000001

#define _ADCORE0L_SAMC4_POSITION                 0x00000004
#define _ADCORE0L_SAMC4_MASK                     0x00000010
#define _ADCORE0L_SAMC4_LENGTH                   0x00000001

#define _ADCORE0L_SAMC5_POSITION                 0x00000005
#define _ADCORE0L_SAMC5_MASK                     0x00000020
#define _ADCORE0L_SAMC5_LENGTH                   0x00000001

#define _ADCORE0L_SAMC6_POSITION                 0x00000006
#define _ADCORE0L_SAMC6_MASK                     0x00000040
#define _ADCORE0L_SAMC6_LENGTH                   0x00000001

#define _ADCORE0L_SAMC7_POSITION                 0x00000007
#define _ADCORE0L_SAMC7_MASK                     0x00000080
#define _ADCORE0L_SAMC7_LENGTH                   0x00000001

#define _ADCORE0L_SAMC8_POSITION                 0x00000008
#define _ADCORE0L_SAMC8_MASK                     0x00000100
#define _ADCORE0L_SAMC8_LENGTH                   0x00000001

#define _ADCORE0L_SAMC9_POSITION                 0x00000009
#define _ADCORE0L_SAMC9_MASK                     0x00000200
#define _ADCORE0L_SAMC9_LENGTH                   0x00000001

