MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _RPOR4_RP35R_POSITION                    0x00000000
#define _RPOR4_RP35R_MASK                        0x0000007F
#define _RPOR4_RP35R_LENGTH                      0x00000007

#define _RPOR4_RP36R_POSITION                    0x00000008
#define _RPOR4_RP36R_MASK                        0x00007F00
#define _RPOR4_RP36R_LENGTH                      0x00000007

#define _RPOR5_RP37R_POSITION                    0x00000000
#define _RPOR5_RP37R_MASK                        0x0000007F
#define _RPOR5_RP37R_LENGTH                      0x00000007

#define _RPOR5_RP38R_POSITION                    0x00000008
#define _RPOR5_RP38R_MASK                        0x00007F00
#define _RPOR5_RP38R_LENGTH                      0x00000007

#define _RPOR6_RP39R_POSITION                    0x00000000
#define _RPOR6_RP39R_MASK                        0x0000007F
#define _RPOR6_RP39R_LENGTH                      0x00000007

#define _RPOR6_RP40R_POSITION                    0x00000008
#define _RPOR6_RP40R_MASK                        0x00007F00
#define _RPOR6_RP40R_LENGTH                      0x00000007

#define _RPOR7_RP41R_POSITION                    0x00000000
#define _RPOR7_RP41R_MASK                        0x0000007F
#define _RPOR7_RP41R_LENGTH                      0x00000007

#define _RPOR7_RP43R_POSITION                    0x00000008
#define _RPOR7_RP43R_MASK                        0x00007F00
#define _RPOR7_RP43R_LENGTH                      0x00000007

#define _RPOR8_RP44R_POSITION                    0x00000000
#define _RPOR8_RP44R_MASK                        0x0000007F
#define _RPOR8_RP44R_LENGTH                      0x00000007

#define _RPOR8_RP45R_POSITION                    0x00000008
#define _RPOR8_RP45R_MASK                        0x00007F00
#define _RPOR8_RP45R_LENGTH                      0x00000007

#define _RPOR9_RP46R_POSITION                    0x00000000
#define _RPOR9_RP46R_MASK                        0x0000007F
#define _RPOR9_RP46R_LENGTH                      0x00000007

#define _RPOR9_RP47R_POSITION                    0x00000008
#define _RPOR9_RP47R_MASK                        0x00007F00
#define _RPOR9_RP47R_LENGTH                      0x00000007

#define _RPOR16_RP61R_POSITION                   0x00000000
#define _RPOR16_RP61R_MASK                       0x0000007F
#define _RPOR16_RP61R_LENGTH                     0x00000007

#define _RPOR16_RP62R_POSITION                   0x00000008
#define _RPOR16_RP62R_MASK                       0x00007F00
#define _RPOR16_RP62R_LENGTH                     0x00000007

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x0000FF00
#define _RPINR2_T1CKR_LENGTH                     0x00000008

#define _RPINR3_T2CKR_POSITION                   0x00000000
#define _RPINR3_T2CKR_MASK                       0x000000FF
#define _RPINR3_T2CKR_LENGTH                     0x00000008

#define _RPINR3_T3CKR_POSITION                   0x00000008
#define _RPINR3_T3CKR_MASK                       0x0000FF00
#define _RPINR3_T3CKR_LENGTH                     0x00000008

#define _RPINR7_IC1R_POSITION                    0x00000000
#define _RPINR7_IC1R_MASK                        0x000000FF
#define _RPINR7_IC1R_LENGTH                      0x00000008

#define _RPINR7_IC2R_POSITION                    0x00000008
#define _RPINR7_IC2R_MASK                        0x0000FF00
#define _RPINR7_IC2R_LENGTH                      0x00000008

#define _RPINR8_IC3R_POSITION                    0x00000000
#define _RPINR8_IC3R_MASK                        0x000000FF
#define _RPINR8_IC3R_LENGTH                      0x00000008

#define _RPINR8_IC4R_POSITION                    0x00000008
#define _RPINR8_IC4R_MASK                        0x0000FF00
#define _RPINR8_IC4R_LENGTH                      0x00000008

#define _RPINR11_OCFAR_POSITION                  0x00000000
#define _RPINR11_OCFAR_MASK                      0x000000FF
#define _RPINR11_OCFAR_LENGTH                    0x00000008

#define _RPINR12_FLT1R_POSITION                  0x00000000
#define _RPINR12_FLT1R_MASK                      0x000000FF
#define _RPINR12_FLT1R_LENGTH                    0x00000008

#define _RPINR12_FLT2R_POSITION                  0x00000008
#define _RPINR12_FLT2R_MASK                      0x0000FF00
#define _RPINR12_FLT2R_LENGTH                    0x00000008

#define _RPINR13_FLT3R_POSITION                  0x00000000
#define _RPINR13_FLT3R_MASK                      0x000000FF
#define _RPINR13_FLT3R_LENGTH                    0x00000008

#define _RPINR13_FLT4R_POSITION                  0x00000008
#define _RPINR13_FLT4R_MASK                      0x0000FF00
#define _RPINR13_FLT4R_LENGTH                    0x00000008

#define _RPINR18_U1RXR_POSITION                  0x00000000
#define _RPINR18_U1RXR_MASK                      0x000000FF
#define _RPINR18_U1RXR_LENGTH                    0x00000008

#define _RPINR18_U1CTSR_POSITION                 0x00000008
#define _RPINR18_U1CTSR_MASK                     0x0000FF00
#define _RPINR18_U1CTSR_LENGTH                   0x00000008

#define _RPINR19_U2RXR_POSITION                  0x00000000
#define _RPINR19_U2RXR_MASK                      0x000000FF
#define _RPINR19_U2RXR_LENGTH                    0x00000008

#define _RPINR19_U2CTSR_POSITION                 0x00000008
#define _RPINR19_U2CTSR_MASK                     0x0000FF00
#define _RPINR19_U2CTSR_LENGTH                   0x00000008

#define _RPINR20_SDI1R_POSITION                  0x00000000
#define _RPINR20_SDI1R_MASK                      0x000000FF
#define _RPINR20_SDI1R_LENGTH                    0x00000008

#define _RPINR20_SCK1INR_POSITION                0x00000008
#define _RPINR20_SCK1INR_MASK                    0x0000FF00
#define _RPINR20_SCK1INR_LENGTH                  0x00000008

#define _RPINR21_SS1INR_POSITION                 0x00000000
#define _RPINR21_SS1INR_MASK                     0x000000FF
#define _RPINR21_SS1INR_LENGTH                   0x00000008

#define _RPINR22_SDI2R_POSITION                  0x00000000
#define _RPINR22_SDI2R_MASK                      0x000000FF
#define _RPINR22_SDI2R_LENGTH                    0x00000008

#define _RPINR22_SCK2INR_POSITION                0x00000008
#define _RPINR22_SCK2INR_MASK                    0x0000FF00
#define _RPINR22_SCK2INR_LENGTH                  0x00000008

#define _RPINR23_SS2INR_POSITION                 0x00000000
#define _RPINR23_SS2INR_MASK                     0x000000FF
#define _RPINR23_SS2INR_LENGTH                   0x00000008

