MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _RPINR29_SDI3R_POSITION                  0x00000000
#define _RPINR29_SDI3R_MASK                      0x000000FF
#define _RPINR29_SDI3R_LENGTH                    0x00000008

#define _RPINR29_SCK3INR_POSITION                0x00000008
#define _RPINR29_SCK3INR_MASK                    0x0000FF00
#define _RPINR29_SCK3INR_LENGTH                  0x00000008

#define _RPINR30_SS3INR_POSITION                 0x00000000
#define _RPINR30_SS3INR_MASK                     0x000000FF
#define _RPINR30_SS3INR_LENGTH                   0x00000008

#define _RPINR37_PSYNCI1R_POSITION               0x00000008
#define _RPINR37_PSYNCI1R_MASK                   0x0000FF00
#define _RPINR37_PSYNCI1R_LENGTH                 0x00000008

#define _RPINR38_PSYNCI2R_POSITION               0x00000000
#define _RPINR38_PSYNCI2R_MASK                   0x000000FF
#define _RPINR38_PSYNCI2R_LENGTH                 0x00000008

#define _RPINR42_FLT5R_POSITION                  0x00000000
#define _RPINR42_FLT5R_MASK                      0x000000FF
#define _RPINR42_FLT5R_LENGTH                    0x00000008

#define _RPINR42_FLT6R_POSITION                  0x00000008
#define _RPINR42_FLT6R_MASK                      0x0000FF00
#define _RPINR42_FLT6R_LENGTH                    0x00000008

#define _RPINR43_FLT7R_POSITION                  0x00000000
#define _RPINR43_FLT7R_MASK                      0x000000FF
#define _RPINR43_FLT7R_LENGTH                    0x00000008

#define _RPINR43_FLT8R_POSITION                  0x00000008
#define _RPINR43_FLT8R_MASK                      0x0000FF00
#define _RPINR43_FLT8R_LENGTH                    0x00000008

#define _RPINR45_CLCINAR_POSITION                0x00000008
#define _RPINR45_CLCINAR_MASK                    0x0000FF00
#define _RPINR45_CLCINAR_LENGTH                  0x00000008

#define _RPINR46_CLCINBR_POSITION                0x00000000
#define _RPINR46_CLCINBR_MASK                    0x000000FF
#define _RPINR46_CLCINBR_LENGTH                  0x00000008

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_URERR_POSITION                   0x00000008
#define _NVMCON_URERR_MASK                       0x00000100
#define _NVMCON_URERR_LENGTH                     0x00000001

#define _NVMCON_RPDF_POSITION                    0x00000009
#define _NVMCON_RPDF_MASK                        0x00000200
#define _NVMCON_RPDF_LENGTH                      0x00000001

#define _NVMCON_P2ACTIV_POSITION                 0x0000000A
#define _NVMCON_P2ACTIV_MASK                     0x00000400
#define _NVMCON_P2ACTIV_LENGTH                   0x00000001

#define _NVMCON_SFTSWP_POSITION                  0x0000000B
#define _NVMCON_SFTSWP_MASK                      0x00000800
#define _NVMCON_SFTSWP_LENGTH                    0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADR_NVMADRL_POSITION                 0x00000001
#define _NVMADR_NVMADRL_MASK                     0x0000FFFE
#define _NVMADR_NVMADRL_LENGTH                   0x0000000F

#define _NVMADR_NVMADR_POSITION                  0x00000001
#define _NVMADR_NVMADR_MASK                      0x0000FFFE
#define _NVMADR_NVMADR_LENGTH                    0x0000000F

#define _NVMADRL_NVMADRL_POSITION                0x00000001
#define _NVMADRL_NVMADRL_MASK                    0x0000FFFE
#define _NVMADRL_NVMADRL_LENGTH                  0x0000000F

#define _NVMADRL_NVMADR_POSITION                 0x00000001
#define _NVMADRL_NVMADR_MASK                     0x0000FFFE
#define _NVMADRL_NVMADR_LENGTH                   0x0000000F

#define _NVMADRH_NVMADRH_POSITION                0x00000000
#define _NVMADRH_NVMADRH_MASK                    0x000000FF
#define _NVMADRH_NVMADRH_LENGTH                  0x00000008

#define _NVMADRH_NVMADRU_POSITION                0x00000000
#define _NVMADRH_NVMADRU_MASK                    0x000000FF
#define _NVMADRH_NVMADRU_LENGTH                  0x00000008

#define _NVMADRU_NVMADRH_POSITION                0x00000000
#define _NVMADRU_NVMADRH_MASK                    0x000000FF
#define _NVMADRU_NVMADRH_LENGTH                  0x00000008

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

#define _NVMSRCADDR_NVMSRCADRL_POSITION          0x00000001
#define _NVMSRCADDR_NVMSRCADRL_MASK              0x0000FFFE
#define _NVMSRCADDR_NVMSRCADRL_LENGTH            0x0000000F

#define _NVMSRCADR_NVMSRCADRL_POSITION           0x00000001
#define _NVMSRCADR_NVMSRCADRL_MASK               0x0000FFFE
#define _NVMSRCADR_NVMSRCADRL_LENGTH             0x0000000F

