MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _IPC31_SPI3EIP_POSITION                  0x00000008
#define _IPC31_SPI3EIP_MASK                      0x00000700
#define _IPC31_SPI3EIP_LENGTH                    0x00000003

#define _IPC31_SPI1EIP0_POSITION                 0x00000000
#define _IPC31_SPI1EIP0_MASK                     0x00000001
#define _IPC31_SPI1EIP0_LENGTH                   0x00000001

#define _IPC31_SPI1EIP1_POSITION                 0x00000001
#define _IPC31_SPI1EIP1_MASK                     0x00000002
#define _IPC31_SPI1EIP1_LENGTH                   0x00000001

#define _IPC31_SPI1EIP2_POSITION                 0x00000002
#define _IPC31_SPI1EIP2_MASK                     0x00000004
#define _IPC31_SPI1EIP2_LENGTH                   0x00000001

#define _IPC31_SPI2EIP0_POSITION                 0x00000004
#define _IPC31_SPI2EIP0_MASK                     0x00000010
#define _IPC31_SPI2EIP0_LENGTH                   0x00000001

#define _IPC31_SPI2EIP1_POSITION                 0x00000005
#define _IPC31_SPI2EIP1_MASK                     0x00000020
#define _IPC31_SPI2EIP1_LENGTH                   0x00000001

#define _IPC31_SPI2EIP2_POSITION                 0x00000006
#define _IPC31_SPI2EIP2_MASK                     0x00000040
#define _IPC31_SPI2EIP2_LENGTH                   0x00000001

#define _IPC31_SPI3EIP0_POSITION                 0x00000008
#define _IPC31_SPI3EIP0_MASK                     0x00000100
#define _IPC31_SPI3EIP0_LENGTH                   0x00000001

#define _IPC31_SPI3EIP1_POSITION                 0x00000009
#define _IPC31_SPI3EIP1_MASK                     0x00000200
#define _IPC31_SPI3EIP1_LENGTH                   0x00000001

#define _IPC31_SPI3EIP2_POSITION                 0x0000000A
#define _IPC31_SPI3EIP2_MASK                     0x00000400
#define _IPC31_SPI3EIP2_LENGTH                   0x00000001

#define _IPC34_CLC1IP_POSITION                   0x00000008
#define _IPC34_CLC1IP_MASK                       0x00000700
#define _IPC34_CLC1IP_LENGTH                     0x00000003

#define _IPC34_CLC2IP_POSITION                   0x0000000C
#define _IPC34_CLC2IP_MASK                       0x00007000
#define _IPC34_CLC2IP_LENGTH                     0x00000003

#define _IPC34_CLC1IP0_POSITION                  0x00000008
#define _IPC34_CLC1IP0_MASK                      0x00000100
#define _IPC34_CLC1IP0_LENGTH                    0x00000001

#define _IPC34_CLC1IP1_POSITION                  0x00000009
#define _IPC34_CLC1IP1_MASK                      0x00000200
#define _IPC34_CLC1IP1_LENGTH                    0x00000001

#define _IPC34_CLC1IP2_POSITION                  0x0000000A
#define _IPC34_CLC1IP2_MASK                      0x00000400
#define _IPC34_CLC1IP2_LENGTH                    0x00000001

#define _IPC34_CLC2IP0_POSITION                  0x0000000C
#define _IPC34_CLC2IP0_MASK                      0x00001000
#define _IPC34_CLC2IP0_LENGTH                    0x00000001

#define _IPC34_CLC2IP1_POSITION                  0x0000000D
#define _IPC34_CLC2IP1_MASK                      0x00002000
#define _IPC34_CLC2IP1_LENGTH                    0x00000001

#define _IPC34_CLC2IP2_POSITION                  0x0000000E
#define _IPC34_CLC2IP2_MASK                      0x00004000
#define _IPC34_CLC2IP2_LENGTH                    0x00000001

#define _IPC35_CLC3IP_POSITION                   0x00000000
#define _IPC35_CLC3IP_MASK                       0x00000007
#define _IPC35_CLC3IP_LENGTH                     0x00000003

#define _IPC35_CLC4IP_POSITION                   0x00000004
#define _IPC35_CLC4IP_MASK                       0x00000070
#define _IPC35_CLC4IP_LENGTH                     0x00000003

#define _IPC35_ICDIP_POSITION                    0x00000008
#define _IPC35_ICDIP_MASK                        0x00000700
#define _IPC35_ICDIP_LENGTH                      0x00000003

#define _IPC35_JTAGIP_POSITION                   0x0000000C
#define _IPC35_JTAGIP_MASK                       0x00007000
#define _IPC35_JTAGIP_LENGTH                     0x00000003

#define _IPC35_CLC3IP0_POSITION                  0x00000000
#define _IPC35_CLC3IP0_MASK                      0x00000001
#define _IPC35_CLC3IP0_LENGTH                    0x00000001

#define _IPC35_CLC3IP1_POSITION                  0x00000001
#define _IPC35_CLC3IP1_MASK                      0x00000002
#define _IPC35_CLC3IP1_LENGTH                    0x00000001

#define _IPC35_CLC3IP2_POSITION                  0x00000002
#define _IPC35_CLC3IP2_MASK                      0x00000004
#define _IPC35_CLC3IP2_LENGTH                    0x00000001

#define _IPC35_CLC4IP0_POSITION                  0x00000004
#define _IPC35_CLC4IP0_MASK                      0x00000010
#define _IPC35_CLC4IP0_LENGTH                    0x00000001

#define _IPC35_CLC4IP1_POSITION                  0x00000005
#define _IPC35_CLC4IP1_MASK                      0x00000020
#define _IPC35_CLC4IP1_LENGTH                    0x00000001

#define _IPC35_CLC4IP2_POSITION                  0x00000006
#define _IPC35_CLC4IP2_MASK                      0x00000040
#define _IPC35_CLC4IP2_LENGTH                    0x00000001

#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _IPC35_JTAGIP0_POSITION                  0x0000000C
#define _IPC35_JTAGIP0_MASK                      0x00001000
#define _IPC35_JTAGIP0_LENGTH                    0x00000001

#define _IPC35_JTAGIP1_POSITION                  0x0000000D
#define _IPC35_JTAGIP1_MASK                      0x00002000
#define _IPC35_JTAGIP1_LENGTH                    0x00000001

#define _IPC35_JTAGIP2_POSITION                  0x0000000E
#define _IPC35_JTAGIP2_MASK                      0x00004000
#define _IPC35_JTAGIP2_LENGTH                    0x00000001

#define _IPC36_PTGSTEPIP_POSITION                0x00000004
#define _IPC36_PTGSTEPIP_MASK                    0x00000070
#define _IPC36_PTGSTEPIP_LENGTH                  0x00000003

