MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _IPC36_PTGWDTIP_POSITION                 0x00000008
#define _IPC36_PTGWDTIP_MASK                     0x00000700
#define _IPC36_PTGWDTIP_LENGTH                   0x00000003

#define _IPC36_PTG0IP_POSITION                   0x0000000C
#define _IPC36_PTG0IP_MASK                       0x00007000
#define _IPC36_PTG0IP_LENGTH                     0x00000003

#define _IPC36_PTGSTEP0_POSITION                 0x00000004
#define _IPC36_PTGSTEP0_MASK                     0x00000010
#define _IPC36_PTGSTEP0_LENGTH                   0x00000001

#define _IPC36_PTGSTEP1_POSITION                 0x00000005
#define _IPC36_PTGSTEP1_MASK                     0x00000020
#define _IPC36_PTGSTEP1_LENGTH                   0x00000001

#define _IPC36_PTGSTEP2_POSITION                 0x00000006
#define _IPC36_PTGSTEP2_MASK                     0x00000040
#define _IPC36_PTGSTEP2_LENGTH                   0x00000001

#define _IPC36_PTGWDTP0_POSITION                 0x00000008
#define _IPC36_PTGWDTP0_MASK                     0x00000100
#define _IPC36_PTGWDTP0_LENGTH                   0x00000001

#define _IPC36_PTGWDTP1_POSITION                 0x00000009
#define _IPC36_PTGWDTP1_MASK                     0x00000200
#define _IPC36_PTGWDTP1_LENGTH                   0x00000001

#define _IPC36_PTGWDTP2_POSITION                 0x0000000A
#define _IPC36_PTGWDTP2_MASK                     0x00000400
#define _IPC36_PTGWDTP2_LENGTH                   0x00000001

#define _IPC36_PTGP0_POSITION                    0x0000000C
#define _IPC36_PTGP0_MASK                        0x00001000
#define _IPC36_PTGP0_LENGTH                      0x00000001

#define _IPC36_PTG0P1_POSITION                   0x0000000D
#define _IPC36_PTG0P1_MASK                       0x00002000
#define _IPC36_PTG0P1_LENGTH                     0x00000001

#define _IPC36_PTG0P2_POSITION                   0x0000000E
#define _IPC36_PTG0P2_MASK                       0x00004000
#define _IPC36_PTG0P2_LENGTH                     0x00000001

#define _IPC37_PTG1IP_POSITION                   0x00000000
#define _IPC37_PTG1IP_MASK                       0x00000007
#define _IPC37_PTG1IP_LENGTH                     0x00000003

#define _IPC37_PTG2IP_POSITION                   0x00000004
#define _IPC37_PTG2IP_MASK                       0x00000070
#define _IPC37_PTG2IP_LENGTH                     0x00000003

#define _IPC37_PTG3IP_POSITION                   0x00000008
#define _IPC37_PTG3IP_MASK                       0x00000700
#define _IPC37_PTG3IP_LENGTH                     0x00000003

#define _IPC37_PTG1P0_POSITION                   0x00000000
#define _IPC37_PTG1P0_MASK                       0x00000001
#define _IPC37_PTG1P0_LENGTH                     0x00000001

#define _IPC37_PTG1P1_POSITION                   0x00000001
#define _IPC37_PTG1P1_MASK                       0x00000002
#define _IPC37_PTG1P1_LENGTH                     0x00000001

#define _IPC37_PTG1P2_POSITION                   0x00000002
#define _IPC37_PTG1P2_MASK                       0x00000004
#define _IPC37_PTG1P2_LENGTH                     0x00000001

#define _IPC37_PTG2P0_POSITION                   0x00000004
#define _IPC37_PTG2P0_MASK                       0x00000010
#define _IPC37_PTG2P0_LENGTH                     0x00000001

#define _IPC37_PTG2P1_POSITION                   0x00000005
#define _IPC37_PTG2P1_MASK                       0x00000020
#define _IPC37_PTG2P1_LENGTH                     0x00000001

#define _IPC37_PTG2P2_POSITION                   0x00000006
#define _IPC37_PTG2P2_MASK                       0x00000040
#define _IPC37_PTG2P2_LENGTH                     0x00000001

#define _IPC37_PTG3P0_POSITION                   0x00000008
#define _IPC37_PTG3P0_MASK                       0x00000100
#define _IPC37_PTG3P0_LENGTH                     0x00000001

#define _IPC37_PTG3P1_POSITION                   0x00000009
#define _IPC37_PTG3P1_MASK                       0x00000200
#define _IPC37_PTG3P1_LENGTH                     0x00000001

#define _IPC37_PTG3P2_POSITION                   0x0000000A
#define _IPC37_PTG3P2_MASK                       0x00000400
#define _IPC37_PTG3P2_LENGTH                     0x00000001

#define _IPC40_ADCAN18IP_POSITION                0x00000004
#define _IPC40_ADCAN18IP_MASK                    0x00000070
#define _IPC40_ADCAN18IP_LENGTH                  0x00000003

#define _IPC40_ADCAN19IP_POSITION                0x00000008
#define _IPC40_ADCAN19IP_MASK                    0x00000700
#define _IPC40_ADCAN19IP_LENGTH                  0x00000003

#define _IPC40_ADCAN20IP_POSITION                0x0000000C
#define _IPC40_ADCAN20IP_MASK                    0x00007000
#define _IPC40_ADCAN20IP_LENGTH                  0x00000003

#define _IPC40_ADCAN18IP0_POSITION               0x00000004
#define _IPC40_ADCAN18IP0_MASK                   0x00000010
#define _IPC40_ADCAN18IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP1_POSITION               0x00000005
#define _IPC40_ADCAN18IP1_MASK                   0x00000020
#define _IPC40_ADCAN18IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN18IP2_POSITION               0x00000006
#define _IPC40_ADCAN18IP2_MASK                   0x00000040
#define _IPC40_ADCAN18IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP0_POSITION               0x00000008
#define _IPC40_ADCAN19IP0_MASK                   0x00000100
#define _IPC40_ADCAN19IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP1_POSITION               0x00000009
#define _IPC40_ADCAN19IP1_MASK                   0x00000200
#define _IPC40_ADCAN19IP1_LENGTH                 0x00000001

#define _IPC40_ADCAN19IP2_POSITION               0x0000000A
#define _IPC40_ADCAN19IP2_MASK                   0x00000400
#define _IPC40_ADCAN19IP2_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP0_POSITION               0x0000000C
#define _IPC40_ADCAN20IP0_MASK                   0x00001000
#define _IPC40_ADCAN20IP0_LENGTH                 0x00000001

#define _IPC40_ADCAN20IP1_POSITION               0x0000000D
#define _IPC40_ADCAN20IP1_MASK                   0x00002000
#define _IPC40_ADCAN20IP1_LENGTH                 0x00000001

