MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _CLC4GLSH_G3D3N_POSITION                 0x00000004
#define _CLC4GLSH_G3D3N_MASK                     0x00000010
#define _CLC4GLSH_G3D3N_LENGTH                   0x00000001

#define _CLC4GLSH_G3D3T_POSITION                 0x00000005
#define _CLC4GLSH_G3D3T_MASK                     0x00000020
#define _CLC4GLSH_G3D3T_LENGTH                   0x00000001

#define _CLC4GLSH_G3D4N_POSITION                 0x00000006
#define _CLC4GLSH_G3D4N_MASK                     0x00000040
#define _CLC4GLSH_G3D4N_LENGTH                   0x00000001

#define _CLC4GLSH_G3D4T_POSITION                 0x00000007
#define _CLC4GLSH_G3D4T_MASK                     0x00000080
#define _CLC4GLSH_G3D4T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D1N_POSITION                 0x00000008
#define _CLC4GLSH_G4D1N_MASK                     0x00000100
#define _CLC4GLSH_G4D1N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D1T_POSITION                 0x00000009
#define _CLC4GLSH_G4D1T_MASK                     0x00000200
#define _CLC4GLSH_G4D1T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D2N_POSITION                 0x0000000A
#define _CLC4GLSH_G4D2N_MASK                     0x00000400
#define _CLC4GLSH_G4D2N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D2T_POSITION                 0x0000000B
#define _CLC4GLSH_G4D2T_MASK                     0x00000800
#define _CLC4GLSH_G4D2T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D3N_POSITION                 0x0000000C
#define _CLC4GLSH_G4D3N_MASK                     0x00001000
#define _CLC4GLSH_G4D3N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D3T_POSITION                 0x0000000D
#define _CLC4GLSH_G4D3T_MASK                     0x00002000
#define _CLC4GLSH_G4D3T_LENGTH                   0x00000001

#define _CLC4GLSH_G4D4N_POSITION                 0x0000000E
#define _CLC4GLSH_G4D4N_MASK                     0x00004000
#define _CLC4GLSH_G4D4N_LENGTH                   0x00000001

#define _CLC4GLSH_G4D4T_POSITION                 0x0000000F
#define _CLC4GLSH_G4D4T_MASK                     0x00008000
#define _CLC4GLSH_G4D4T_LENGTH                   0x00000001

#define _PTGCST_PTGITM_POSITION                  0x00000000
#define _PTGCST_PTGITM_MASK                      0x00000003
#define _PTGCST_PTGITM_LENGTH                    0x00000002

#define _PTGCST_PTGWTO_POSITION                  0x00000006
#define _PTGCST_PTGWTO_MASK                      0x00000040
#define _PTGCST_PTGWTO_LENGTH                    0x00000001

#define _PTGCST_PTGSTRT_POSITION                 0x00000007
#define _PTGCST_PTGSTRT_MASK                     0x00000080
#define _PTGCST_PTGSTRT_LENGTH                   0x00000001

#define _PTGCST_PTGIVIS_POSITION                 0x00000008
#define _PTGCST_PTGIVIS_MASK                     0x00000100
#define _PTGCST_PTGIVIS_LENGTH                   0x00000001

#define _PTGCST_PTGSSEN_POSITION                 0x00000009
#define _PTGCST_PTGSSEN_MASK                     0x00000200
#define _PTGCST_PTGSSEN_LENGTH                   0x00000001

#define _PTGCST_PTGSWT_POSITION                  0x0000000A
#define _PTGCST_PTGSWT_MASK                      0x00000400
#define _PTGCST_PTGSWT_LENGTH                    0x00000001

#define _PTGCST_PTGTOGL_POSITION                 0x0000000C
#define _PTGCST_PTGTOGL_MASK                     0x00001000
#define _PTGCST_PTGTOGL_LENGTH                   0x00000001

#define _PTGCST_PTGSIDL_POSITION                 0x0000000D
#define _PTGCST_PTGSIDL_MASK                     0x00002000
#define _PTGCST_PTGSIDL_LENGTH                   0x00000001

#define _PTGCST_PTGEN_POSITION                   0x0000000F
#define _PTGCST_PTGEN_MASK                       0x00008000
#define _PTGCST_PTGEN_LENGTH                     0x00000001

#define _PTGCON_PTGWDT_POSITION                  0x00000000
#define _PTGCON_PTGWDT_MASK                      0x00000007
#define _PTGCON_PTGWDT_LENGTH                    0x00000003

#define _PTGCON_PTGPWD_POSITION                  0x00000004
#define _PTGCON_PTGPWD_MASK                      0x000000F0
#define _PTGCON_PTGPWD_LENGTH                    0x00000004

#define _PTGCON_PTGDIV_POSITION                  0x00000008
#define _PTGCON_PTGDIV_MASK                      0x00001F00
#define _PTGCON_PTGDIV_LENGTH                    0x00000005

#define _PTGCON_PTGCLK_POSITION                  0x0000000D
#define _PTGCON_PTGCLK_MASK                      0x0000E000
#define _PTGCON_PTGCLK_LENGTH                    0x00000003

#define _PTGBTE_OC1TSS_POSITION                  0x00000000
#define _PTGBTE_OC1TSS_MASK                      0x00000001
#define _PTGBTE_OC1TSS_LENGTH                    0x00000001

#define _PTGBTE_OC2TSS_POSITION                  0x00000001
#define _PTGBTE_OC2TSS_MASK                      0x00000002
#define _PTGBTE_OC2TSS_LENGTH                    0x00000001

#define _PTGBTE_OC3TSS_POSITION                  0x00000002
#define _PTGBTE_OC3TSS_MASK                      0x00000004
#define _PTGBTE_OC3TSS_LENGTH                    0x00000001

#define _PTGBTE_OC4TSS_POSITION                  0x00000003
#define _PTGBTE_OC4TSS_MASK                      0x00000008
#define _PTGBTE_OC4TSS_LENGTH                    0x00000001

#define _PTGBTE_OC1CS_POSITION                   0x00000004
#define _PTGBTE_OC1CS_MASK                       0x00000010
#define _PTGBTE_OC1CS_LENGTH                     0x00000001

#define _PTGBTE_OC2CS_POSITION                   0x00000005
#define _PTGBTE_OC2CS_MASK                       0x00000020
#define _PTGBTE_OC2CS_LENGTH                     0x00000001

#define _PTGBTE_OC3CS_POSITION                   0x00000006
#define _PTGBTE_OC3CS_MASK                       0x00000040
#define _PTGBTE_OC3CS_LENGTH                     0x00000001

#define _PTGBTE_OC4CS_POSITION                   0x00000007
#define _PTGBTE_OC4CS_MASK                       0x00000080
#define _PTGBTE_OC4CS_LENGTH                     0x00000001

#define _PTGBTE_IC1TSS_POSITION                  0x00000008
#define _PTGBTE_IC1TSS_MASK                      0x00000100
#define _PTGBTE_IC1TSS_LENGTH                    0x00000001

