MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define _CNPDB_CNPDB6_POSITION                   0x00000006
#define _CNPDB_CNPDB6_MASK                       0x00000040
#define _CNPDB_CNPDB6_LENGTH                     0x00000001

#define _CNPDB_CNPDB7_POSITION                   0x00000007
#define _CNPDB_CNPDB7_MASK                       0x00000080
#define _CNPDB_CNPDB7_LENGTH                     0x00000001

#define _CNPDB_CNPDB8_POSITION                   0x00000008
#define _CNPDB_CNPDB8_MASK                       0x00000100
#define _CNPDB_CNPDB8_LENGTH                     0x00000001

#define _CNPDB_CNPDB9_POSITION                   0x00000009
#define _CNPDB_CNPDB9_MASK                       0x00000200
#define _CNPDB_CNPDB9_LENGTH                     0x00000001

#define _CNPDB_CNPDB11_POSITION                  0x0000000B
#define _CNPDB_CNPDB11_MASK                      0x00000800
#define _CNPDB_CNPDB11_LENGTH                    0x00000001

#define _CNPDB_CNPDB12_POSITION                  0x0000000C
#define _CNPDB_CNPDB12_MASK                      0x00001000
#define _CNPDB_CNPDB12_LENGTH                    0x00000001

#define _CNPDB_CNPDB13_POSITION                  0x0000000D
#define _CNPDB_CNPDB13_MASK                      0x00002000
#define _CNPDB_CNPDB13_LENGTH                    0x00000001

#define _CNPDB_CNPDB14_POSITION                  0x0000000E
#define _CNPDB_CNPDB14_MASK                      0x00004000
#define _CNPDB_CNPDB14_LENGTH                    0x00000001

#define _CNPDB_CNPDB15_POSITION                  0x0000000F
#define _CNPDB_CNPDB15_MASK                      0x00008000
#define _CNPDB_CNPDB15_LENGTH                    0x00000001

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB5_POSITION                   0x00000005
#define _ANSELB_ANSB5_MASK                       0x00000020
#define _ANSELB_ANSB5_LENGTH                     0x00000001

#define _ANSELB_ANSB6_POSITION                   0x00000006
#define _ANSELB_ANSB6_MASK                       0x00000040
#define _ANSELB_ANSB6_LENGTH                     0x00000001

#define _ANSELB_ANSB7_POSITION                   0x00000007
#define _ANSELB_ANSB7_MASK                       0x00000080
#define _ANSELB_ANSB7_LENGTH                     0x00000001

#define _ANSELB_ANSB9_POSITION                   0x00000009
#define _ANSELB_ANSB9_MASK                       0x00000200
#define _ANSELB_ANSB9_LENGTH                     0x00000001

#define _APPS_APIFUL_POSITION                    0x00000000
#define _APPS_APIFUL_MASK                        0x00000001
#define _APPS_APIFUL_LENGTH                      0x00000001

#define _APPS_APIOV_POSITION                     0x00000001
#define _APPS_APIOV_MASK                         0x00000002
#define _APPS_APIOV_LENGTH                       0x00000001

#define _APPS_APOFUL_POSITION                    0x00000002
#define _APPS_APOFUL_MASK                        0x00000004
#define _APPS_APOFUL_LENGTH                      0x00000001

#define _APPS_APOOV_POSITION                     0x00000003
#define _APPS_APOOV_MASK                         0x00000008
#define _APPS_APOOV_LENGTH                       0x00000001

#define _APPS_STRFUL_POSITION                    0x00000004
#define _APPS_STRFUL_MASK                        0x00000010
#define _APPS_STRFUL_LENGTH                      0x00000001



/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Fuses that are always present */

/* Register FBOOT (0x801000)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBOOT;
#define _FBOOT(x) __attribute__((address(0x801000),deprecated_definition("consider migrating to #pragma config"),section("__FBOOT.sec"),space(prog))) __prog__ uint16_t _FBOOT = (x);

/*
** Only one invocation of FBOOT should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBOOT.
** Multiple options may be combined, as shown:
**
** _FBOOT( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Mode Configuration Bits:
**     BTMODE_DUALPRIV      Device is in Dual Partition Privilege mode
**     BTMODE_DUALPROT      Device is in Dual Partition Protected mode
**     BTMODE_DUAL          Device is in Dual Partition mode
**     BTMODE_SINGLE        Device is in Single Boot (legacy) mode
**
*/

#define BTMODE_DUALPRIV      0x0000
#define BTMODE_DUALPROT      0x0001
#define BTMODE_DUAL          0x0002
#define BTMODE_SINGLE        0x0003

/* Fuses that are only present in single panel mode */

#ifndef __DUAL_PARTITION
/* Register FSEC (0x15780)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSEC;
#define _FSEC(x) __attribute__((address(0x15780),deprecated_definition("consider migrating to #pragma config"),section("__FSEC.sec"),space(prog))) __prog__ uint16_t _FSEC = (x);

/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HIGH             High Security
**     BSS_STNDRD           Standard Security
**     BSS_DISABLED         No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HIGH             High Security
**     GSS_STNDRD           Standard Security
**     GSS_DISABLED         No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HIGH             High Security
**     CSS_ENHNCD           Enhanced Security
**     CSS_STNDRD           Standard Security
**     CSS_DISABLED         No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table bit:
**     ENABLE               Enabled AIVT
**     DISABLE              Disabled AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

