MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define ALTI2C1_ON           0x0051
#define ALTI2C1_OFF          0x0059

#define ALTI2C2_ON           0x0049
#define ALTI2C2_OFF          0x0059

#define DBCC_ON              0x0019
#define DBCC_OFF             0x0059

/* Register FALTREG (0xabb0)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FALTREG;
#define _FALTREG(x) __attribute__((address(0xabb0),deprecated_definition("consider migrating to #pragma config"),section("__FALTREG.sec"),space(prog))) __prog__ uint16_t _FALTREG = (x);

/*
** Only one invocation of FALTREG should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FALTREG.
** Multiple options may be combined, as shown:
**
** _FALTREG( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 1 bits:
**     CTXT1_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT1_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT1_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT1_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT1_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT1_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT1_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT1_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT2_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT2_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT2_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT2_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT2_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT2_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT2_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT2_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT3_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT3_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT3_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT3_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT3_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT3_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT3_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT3_OFF            Not Assigned
**
**   Specifies Interrupt Priority Level (IPL) Associated to Alternate Working Register 2 bits:
**     CTXT4_IPL1           Alternate Register set assigned to IPL level 1
**     CTXT4_IPL2           Alternate Register set assigned to IPL level 2
**     CTXT4_IPL3           Alternate Register set assigned to IPL level 3
**     CTXT4_IPL4           Alternate Register set assigned to IPL level 4
**     CTXT4_IPL5           Alternate Register set assigned to IPL level 5
**     CTXT4_IPL6           Alternate Register set assigned to IPL level 6
**     CTXT4_IPL7           Alternate Register set assigned to IPL level 7
**     CTXT4_OFF            Not Assigned
**
*/

#define CTXT1_IPL1           0x7770
#define CTXT1_IPL2           0x7771
#define CTXT1_IPL3           0x7772
#define CTXT1_IPL4           0x7773
#define CTXT1_IPL5           0x7774
#define CTXT1_IPL6           0x7775
#define CTXT1_IPL7           0x7776
#define CTXT1_OFF            0x7777

#define CTXT2_IPL1           0x7707
#define CTXT2_IPL2           0x7717
#define CTXT2_IPL3           0x7727
#define CTXT2_IPL4           0x7737
#define CTXT2_IPL5           0x7747
#define CTXT2_IPL6           0x7757
#define CTXT2_IPL7           0x7767
#define CTXT2_OFF            0x7777

#define CTXT3_IPL1           0x7077
#define CTXT3_IPL2           0x7177
#define CTXT3_IPL3           0x7277
#define CTXT3_IPL4           0x7377
#define CTXT3_IPL5           0x7477
#define CTXT3_IPL6           0x7577
#define CTXT3_IPL7           0x7677
#define CTXT3_OFF            0x7777

#define CTXT4_IPL1           0x0777
#define CTXT4_IPL2           0x1777
#define CTXT4_IPL3           0x2777
#define CTXT4_IPL4           0x3777
#define CTXT4_IPL5           0x4777
#define CTXT4_IPL6           0x5777
#define CTXT4_IPL7           0x6777
#define CTXT4_OFF            0x7777

/* Register FBTSEQ (0xabfc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0xabfc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**     BSEQ_BSEQ            Boot Sequence Number bits
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**     IBSEQ_IBSEQ          Inverse Boot Sequence Number bits
**
*/

#define BSEQ_BSEQ            0xF000

#define IBSEQ_IBSEQ          0xFF0FFF

#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x200

#undef _FLASH_ROW
#define _FLASH_ROW 0x40

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __PGA1CAL_BASE 0x800e48
#define __PGA1CAL_LENGTH 0x2

