MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GS702/mcu.h
#define __PGA2CAL_BASE 0x800e4c
#define __PGA2CAL_LENGTH 0x2

#define __ISRCCAL_BASE 0x800e78
#define __ISRCCAL_LENGTH 0x2

#define __FBOOT_BASE 0x801000
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x15580

#define __FSEC_BASE 0x15780
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x15790
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x15794
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x15798
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x1579c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x157a0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x157a4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x157a8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0x157ac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0x157b0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0x157fc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x200

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0x1fc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xa980

#define __FSEC_BASE 0xab80
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xab90
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xab94
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xab98
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xab9c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xaba0
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xaba4
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xaba8
#define __FICD_LENGTH 0x2

#define __FDEVOPT_BASE 0xabac
#define __FDEVOPT_LENGTH 0x2

#define __FALTREG_BASE 0xabb0
#define __FALTREG_LENGTH 0x2

#define __FBTSEQ_BASE 0xabfc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x1000

#define __DATA_BASE 0x1000
#define __DATA_LENGTH 0x2000

#define __YDATA_BASE 0x2000
#define __YDATA_LENGTH 0x2000

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 1
#define _RPOUT_U1RTS 2
#define _RPOUT_U2TX 3
#define _RPOUT_U2RTS 4
#define _RPOUT_SDO1 5
#define _RPOUT_SCK1 6
#define _RPOUT_SS1 7
#define _RPOUT_SDO2 8
#define _RPOUT_SCK2 9
#define _RPOUT_SS2 10
#define _RPOUT_OC1 16
#define _RPOUT_OC2 17
#define _RPOUT_OC3 18
#define _RPOUT_OC4 19
#define _RPOUT_ACMP1 24
#define _RPOUT_ACMP2 25
#define _RPOUT_ACMP3 26
#define _RPOUT_SYNCO1 45
#define _RPOUT_SYNCO2 46
#define _RPOUT_REFCLKO 49
#define _RPOUT_ACMP4 50
#define _RPOUT_PWM4H 51
#define _RPOUT_PWM4L 52
#define _RPOUT_PWM5H 53
#define _RPOUT_PWM5L 54
#define _RPOUT_PWM6H 57
#define _RPOUT_PWM6L 58
#define _RPOUT_PWM7H 59
#define _RPOUT_PWM7L 60
#define _RPOUT_PWM8H 61
#define _RPOUT_PWM8L 62
#define _RPOUT_CLC1OUT 63
#define _RPOUT_CLC2OUT 64
#define _RPOUT_CLC3OUT 65
#define _RPOUT_CLC4OUT 66
#define _RPOUT_SDO3 31
#define _RPOUT_SCK3 32
#define _RPOUT_SS3 33

#endif
